MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K80/mcu.h
// Register: RXF6SIDH
#define RXF6SIDH RXF6SIDH
extern volatile unsigned char           RXF6SIDH            __at(0xE48);
#ifndef _LIB_BUILD
asm("RXF6SIDH equ 0E48h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF6SID3               :1;
        unsigned RXF6SID4               :1;
        unsigned RXF6SID5               :1;
        unsigned RXF6SID6               :1;
        unsigned RXF6SID7               :1;
        unsigned RXF6SID8               :1;
        unsigned RXF6SID9               :1;
        unsigned RXF6SID10              :1;
    };
} RXF6SIDHbits_t;
extern volatile RXF6SIDHbits_t RXF6SIDHbits __at(0xE48);
// bitfield macros
#define _RXF6SIDH_SID_POSN                                  0x0
#define _RXF6SIDH_SID_POSITION                              0x0
#define _RXF6SIDH_SID_SIZE                                  0x8
#define _RXF6SIDH_SID_LENGTH                                0x8
#define _RXF6SIDH_SID_MASK                                  0xFF
#define _RXF6SIDH_SID3_POSN                                 0x0
#define _RXF6SIDH_SID3_POSITION                             0x0
#define _RXF6SIDH_SID3_SIZE                                 0x1
#define _RXF6SIDH_SID3_LENGTH                               0x1
#define _RXF6SIDH_SID3_MASK                                 0x1
#define _RXF6SIDH_SID4_POSN                                 0x1
#define _RXF6SIDH_SID4_POSITION                             0x1
#define _RXF6SIDH_SID4_SIZE                                 0x1
#define _RXF6SIDH_SID4_LENGTH                               0x1
#define _RXF6SIDH_SID4_MASK                                 0x2
#define _RXF6SIDH_SID5_POSN                                 0x2
#define _RXF6SIDH_SID5_POSITION                             0x2
#define _RXF6SIDH_SID5_SIZE                                 0x1
#define _RXF6SIDH_SID5_LENGTH                               0x1
#define _RXF6SIDH_SID5_MASK                                 0x4
#define _RXF6SIDH_SID6_POSN                                 0x3
#define _RXF6SIDH_SID6_POSITION                             0x3
#define _RXF6SIDH_SID6_SIZE                                 0x1
#define _RXF6SIDH_SID6_LENGTH                               0x1
#define _RXF6SIDH_SID6_MASK                                 0x8
#define _RXF6SIDH_SID7_POSN                                 0x4
#define _RXF6SIDH_SID7_POSITION                             0x4
#define _RXF6SIDH_SID7_SIZE                                 0x1
#define _RXF6SIDH_SID7_LENGTH                               0x1
#define _RXF6SIDH_SID7_MASK                                 0x10
#define _RXF6SIDH_SID8_POSN                                 0x5
#define _RXF6SIDH_SID8_POSITION                             0x5
#define _RXF6SIDH_SID8_SIZE                                 0x1
#define _RXF6SIDH_SID8_LENGTH                               0x1
#define _RXF6SIDH_SID8_MASK                                 0x20
#define _RXF6SIDH_SID9_POSN                                 0x6
#define _RXF6SIDH_SID9_POSITION                             0x6
#define _RXF6SIDH_SID9_SIZE                                 0x1
#define _RXF6SIDH_SID9_LENGTH                               0x1
#define _RXF6SIDH_SID9_MASK                                 0x40
#define _RXF6SIDH_SID10_POSN                                0x7
#define _RXF6SIDH_SID10_POSITION                            0x7
#define _RXF6SIDH_SID10_SIZE                                0x1
#define _RXF6SIDH_SID10_LENGTH                              0x1
#define _RXF6SIDH_SID10_MASK                                0x80
#define _RXF6SIDH_RXF6SID3_POSN                             0x0
#define _RXF6SIDH_RXF6SID3_POSITION                         0x0
#define _RXF6SIDH_RXF6SID3_SIZE                             0x1
#define _RXF6SIDH_RXF6SID3_LENGTH                           0x1
#define _RXF6SIDH_RXF6SID3_MASK                             0x1
#define _RXF6SIDH_RXF6SID4_POSN                             0x1
#define _RXF6SIDH_RXF6SID4_POSITION                         0x1
#define _RXF6SIDH_RXF6SID4_SIZE                             0x1
#define _RXF6SIDH_RXF6SID4_LENGTH                           0x1
#define _RXF6SIDH_RXF6SID4_MASK                             0x2
#define _RXF6SIDH_RXF6SID5_POSN                             0x2
#define _RXF6SIDH_RXF6SID5_POSITION                         0x2
#define _RXF6SIDH_RXF6SID5_SIZE                             0x1
#define _RXF6SIDH_RXF6SID5_LENGTH                           0x1
#define _RXF6SIDH_RXF6SID5_MASK                             0x4
#define _RXF6SIDH_RXF6SID6_POSN                             0x3
#define _RXF6SIDH_RXF6SID6_POSITION                         0x3
#define _RXF6SIDH_RXF6SID6_SIZE                             0x1
#define _RXF6SIDH_RXF6SID6_LENGTH                           0x1
#define _RXF6SIDH_RXF6SID6_MASK                             0x8
#define _RXF6SIDH_RXF6SID7_POSN                             0x4
#define _RXF6SIDH_RXF6SID7_POSITION                         0x4
#define _RXF6SIDH_RXF6SID7_SIZE                             0x1
#define _RXF6SIDH_RXF6SID7_LENGTH                           0x1
#define _RXF6SIDH_RXF6SID7_MASK                             0x10
#define _RXF6SIDH_RXF6SID8_POSN                             0x5
#define _RXF6SIDH_RXF6SID8_POSITION                         0x5
#define _RXF6SIDH_RXF6SID8_SIZE                             0x1
#define _RXF6SIDH_RXF6SID8_LENGTH                           0x1
#define _RXF6SIDH_RXF6SID8_MASK                             0x20
#define _RXF6SIDH_RXF6SID9_POSN                             0x6
#define _RXF6SIDH_RXF6SID9_POSITION                         0x6
#define _RXF6SIDH_RXF6SID9_SIZE                             0x1
#define _RXF6SIDH_RXF6SID9_LENGTH                           0x1
#define _RXF6SIDH_RXF6SID9_MASK                             0x40
#define _RXF6SIDH_RXF6SID10_POSN                            0x7
#define _RXF6SIDH_RXF6SID10_POSITION                        0x7
#define _RXF6SIDH_RXF6SID10_SIZE                            0x1
#define _RXF6SIDH_RXF6SID10_LENGTH                          0x1
#define _RXF6SIDH_RXF6SID10_MASK                            0x80

// Register: RXF6SIDL
#define RXF6SIDL RXF6SIDL
extern volatile unsigned char           RXF6SIDL            __at(0xE49);
#ifndef _LIB_BUILD
asm("RXF6SIDL equ 0E49h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXF6EID16              :1;
        unsigned RXF6EID17              :1;
        unsigned                        :1;
        unsigned RXF6EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF6SID0               :1;
        unsigned RXF6SID1               :1;
        unsigned RXF6SID2               :1;
    };
} RXF6SIDLbits_t;
extern volatile RXF6SIDLbits_t RXF6SIDLbits __at(0xE49);
// bitfield macros
#define _RXF6SIDL_EID_POSN                                  0x0
#define _RXF6SIDL_EID_POSITION                              0x0
#define _RXF6SIDL_EID_SIZE                                  0x2
#define _RXF6SIDL_EID_LENGTH                                0x2
#define _RXF6SIDL_EID_MASK                                  0x3
#define _RXF6SIDL_EXIDEN_POSN                               0x3
#define _RXF6SIDL_EXIDEN_POSITION                           0x3
#define _RXF6SIDL_EXIDEN_SIZE                               0x1
#define _RXF6SIDL_EXIDEN_LENGTH                             0x1
#define _RXF6SIDL_EXIDEN_MASK                               0x8
#define _RXF6SIDL_SID_POSN                                  0x5
#define _RXF6SIDL_SID_POSITION                              0x5
#define _RXF6SIDL_SID_SIZE                                  0x3
#define _RXF6SIDL_SID_LENGTH                                0x3
#define _RXF6SIDL_SID_MASK                                  0xE0
#define _RXF6SIDL_EID16_POSN                                0x0
#define _RXF6SIDL_EID16_POSITION                            0x0
#define _RXF6SIDL_EID16_SIZE                                0x1
#define _RXF6SIDL_EID16_LENGTH                              0x1
#define _RXF6SIDL_EID16_MASK                                0x1
#define _RXF6SIDL_EID17_POSN                                0x1
#define _RXF6SIDL_EID17_POSITION                            0x1
#define _RXF6SIDL_EID17_SIZE                                0x1
#define _RXF6SIDL_EID17_LENGTH                              0x1
#define _RXF6SIDL_EID17_MASK                                0x2
#define _RXF6SIDL_SID0_POSN                                 0x5
#define _RXF6SIDL_SID0_POSITION                             0x5
#define _RXF6SIDL_SID0_SIZE                                 0x1
#define _RXF6SIDL_SID0_LENGTH                               0x1
#define _RXF6SIDL_SID0_MASK                                 0x20
#define _RXF6SIDL_SID1_POSN                                 0x6
#define _RXF6SIDL_SID1_POSITION                             0x6
#define _RXF6SIDL_SID1_SIZE                                 0x1
#define _RXF6SIDL_SID1_LENGTH                               0x1
#define _RXF6SIDL_SID1_MASK                                 0x40
#define _RXF6SIDL_SID2_POSN                                 0x7
#define _RXF6SIDL_SID2_POSITION                             0x7
#define _RXF6SIDL_SID2_SIZE                                 0x1
#define _RXF6SIDL_SID2_LENGTH                               0x1
#define _RXF6SIDL_SID2_MASK                                 0x80
#define _RXF6SIDL_RXF6EID16_POSN                            0x0
#define _RXF6SIDL_RXF6EID16_POSITION                        0x0
#define _RXF6SIDL_RXF6EID16_SIZE                            0x1
#define _RXF6SIDL_RXF6EID16_LENGTH                          0x1
#define _RXF6SIDL_RXF6EID16_MASK                            0x1
#define _RXF6SIDL_RXF6EID17_POSN                            0x1
#define _RXF6SIDL_RXF6EID17_POSITION                        0x1
#define _RXF6SIDL_RXF6EID17_SIZE                            0x1
#define _RXF6SIDL_RXF6EID17_LENGTH                          0x1
#define _RXF6SIDL_RXF6EID17_MASK                            0x2
#define _RXF6SIDL_RXF6EXIDEN_POSN                           0x3
#define _RXF6SIDL_RXF6EXIDEN_POSITION                       0x3
#define _RXF6SIDL_RXF6EXIDEN_SIZE                           0x1
#define _RXF6SIDL_RXF6EXIDEN_LENGTH                         0x1
#define _RXF6SIDL_RXF6EXIDEN_MASK                           0x8
#define _RXF6SIDL_RXF6SID0_POSN                             0x5
#define _RXF6SIDL_RXF6SID0_POSITION                         0x5
#define _RXF6SIDL_RXF6SID0_SIZE                             0x1
#define _RXF6SIDL_RXF6SID0_LENGTH                           0x1
#define _RXF6SIDL_RXF6SID0_MASK                             0x20
#define _RXF6SIDL_RXF6SID1_POSN                             0x6
#define _RXF6SIDL_RXF6SID1_POSITION                         0x6
#define _RXF6SIDL_RXF6SID1_SIZE                             0x1
#define _RXF6SIDL_RXF6SID1_LENGTH                           0x1
#define _RXF6SIDL_RXF6SID1_MASK                             0x40
#define _RXF6SIDL_RXF6SID2_POSN                             0x7
#define _RXF6SIDL_RXF6SID2_POSITION                         0x7
#define _RXF6SIDL_RXF6SID2_SIZE                             0x1
#define _RXF6SIDL_RXF6SID2_LENGTH                           0x1
#define _RXF6SIDL_RXF6SID2_MASK                             0x80

// Register: RXF6EIDH
#define RXF6EIDH RXF6EIDH
extern volatile unsigned char           RXF6EIDH            __at(0xE4A);
#ifndef _LIB_BUILD
asm("RXF6EIDH equ 0E4Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF6EID8               :1;
        unsigned RXF6EID9               :1;
        unsigned RXF6EID10              :1;
        unsigned RXF6EID11              :1;
        unsigned RXF6EID12              :1;
        unsigned RXF6EID13              :1;
        unsigned RXF6EID14              :1;
        unsigned RXF6EID15              :1;
    };
} RXF6EIDHbits_t;
extern volatile RXF6EIDHbits_t RXF6EIDHbits __at(0xE4A);
// bitfield macros
#define _RXF6EIDH_EID_POSN                                  0x0
#define _RXF6EIDH_EID_POSITION                              0x0
#define _RXF6EIDH_EID_SIZE                                  0x8
#define _RXF6EIDH_EID_LENGTH                                0x8
#define _RXF6EIDH_EID_MASK                                  0xFF
#define _RXF6EIDH_EID8_POSN                                 0x0
#define _RXF6EIDH_EID8_POSITION                             0x0
#define _RXF6EIDH_EID8_SIZE                                 0x1
#define _RXF6EIDH_EID8_LENGTH                               0x1
#define _RXF6EIDH_EID8_MASK                                 0x1
#define _RXF6EIDH_EID9_POSN                                 0x1
#define _RXF6EIDH_EID9_POSITION                             0x1
#define _RXF6EIDH_EID9_SIZE                                 0x1
#define _RXF6EIDH_EID9_LENGTH                               0x1
#define _RXF6EIDH_EID9_MASK                                 0x2
#define _RXF6EIDH_EID10_POSN                                0x2
#define _RXF6EIDH_EID10_POSITION                            0x2
#define _RXF6EIDH_EID10_SIZE                                0x1
#define _RXF6EIDH_EID10_LENGTH                              0x1
#define _RXF6EIDH_EID10_MASK                                0x4
#define _RXF6EIDH_EID11_POSN                                0x3
#define _RXF6EIDH_EID11_POSITION                            0x3
#define _RXF6EIDH_EID11_SIZE                                0x1
#define _RXF6EIDH_EID11_LENGTH                              0x1
#define _RXF6EIDH_EID11_MASK                                0x8
#define _RXF6EIDH_EID12_POSN                                0x4
#define _RXF6EIDH_EID12_POSITION                            0x4
#define _RXF6EIDH_EID12_SIZE                                0x1
#define _RXF6EIDH_EID12_LENGTH                              0x1
#define _RXF6EIDH_EID12_MASK                                0x10
#define _RXF6EIDH_EID13_POSN                                0x5
#define _RXF6EIDH_EID13_POSITION                            0x5
#define _RXF6EIDH_EID13_SIZE                                0x1
#define _RXF6EIDH_EID13_LENGTH                              0x1
#define _RXF6EIDH_EID13_MASK                                0x20
#define _RXF6EIDH_EID14_POSN                                0x6
#define _RXF6EIDH_EID14_POSITION                            0x6
#define _RXF6EIDH_EID14_SIZE                                0x1
#define _RXF6EIDH_EID14_LENGTH                              0x1
#define _RXF6EIDH_EID14_MASK                                0x40
#define _RXF6EIDH_EID15_POSN                                0x7
#define _RXF6EIDH_EID15_POSITION                            0x7
#define _RXF6EIDH_EID15_SIZE                                0x1
#define _RXF6EIDH_EID15_LENGTH                              0x1
#define _RXF6EIDH_EID15_MASK                                0x80
#define _RXF6EIDH_RXF6EID8_POSN                             0x0
#define _RXF6EIDH_RXF6EID8_POSITION                         0x0
#define _RXF6EIDH_RXF6EID8_SIZE                             0x1
#define _RXF6EIDH_RXF6EID8_LENGTH                           0x1
#define _RXF6EIDH_RXF6EID8_MASK                             0x1
#define _RXF6EIDH_RXF6EID9_POSN                             0x1
#define _RXF6EIDH_RXF6EID9_POSITION                         0x1
#define _RXF6EIDH_RXF6EID9_SIZE                             0x1
#define _RXF6EIDH_RXF6EID9_LENGTH                           0x1
#define _RXF6EIDH_RXF6EID9_MASK                             0x2
#define _RXF6EIDH_RXF6EID10_POSN                            0x2
#define _RXF6EIDH_RXF6EID10_POSITION                        0x2
#define _RXF6EIDH_RXF6EID10_SIZE                            0x1
#define _RXF6EIDH_RXF6EID10_LENGTH                          0x1
#define _RXF6EIDH_RXF6EID10_MASK                            0x4
#define _RXF6EIDH_RXF6EID11_POSN                            0x3
#define _RXF6EIDH_RXF6EID11_POSITION                        0x3
#define _RXF6EIDH_RXF6EID11_SIZE                            0x1
#define _RXF6EIDH_RXF6EID11_LENGTH                          0x1
#define _RXF6EIDH_RXF6EID11_MASK                            0x8
#define _RXF6EIDH_RXF6EID12_POSN                            0x4
#define _RXF6EIDH_RXF6EID12_POSITION                        0x4
#define _RXF6EIDH_RXF6EID12_SIZE                            0x1
#define _RXF6EIDH_RXF6EID12_LENGTH                          0x1
#define _RXF6EIDH_RXF6EID12_MASK                            0x10
#define _RXF6EIDH_RXF6EID13_POSN                            0x5
#define _RXF6EIDH_RXF6EID13_POSITION                        0x5
#define _RXF6EIDH_RXF6EID13_SIZE                            0x1
#define _RXF6EIDH_RXF6EID13_LENGTH                          0x1
#define _RXF6EIDH_RXF6EID13_MASK                            0x20
#define _RXF6EIDH_RXF6EID14_POSN                            0x6
#define _RXF6EIDH_RXF6EID14_POSITION                        0x6
#define _RXF6EIDH_RXF6EID14_SIZE                            0x1
#define _RXF6EIDH_RXF6EID14_LENGTH                          0x1
#define _RXF6EIDH_RXF6EID14_MASK                            0x40
#define _RXF6EIDH_RXF6EID15_POSN                            0x7
#define _RXF6EIDH_RXF6EID15_POSITION                        0x7
#define _RXF6EIDH_RXF6EID15_SIZE                            0x1
#define _RXF6EIDH_RXF6EID15_LENGTH                          0x1
#define _RXF6EIDH_RXF6EID15_MASK                            0x80

// Register: RXF6EIDL
#define RXF6EIDL RXF6EIDL
extern volatile unsigned char           RXF6EIDL            __at(0xE4B);
#ifndef _LIB_BUILD
asm("RXF6EIDL equ 0E4Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF6EID0               :1;
        unsigned RXF6EID1               :1;
        unsigned RXF6EID2               :1;
        unsigned RXF6EID3               :1;
        unsigned RXF6EID4               :1;
        unsigned RXF6EID5               :1;
        unsigned RXF6EID6               :1;
        unsigned RXF6EID7               :1;
    };
} RXF6EIDLbits_t;
