MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K80/mcu.h
extern volatile SDFLCbits_t SDFLCbits __at(0xE70);
// bitfield macros
#define _SDFLC_FLC_POSN                                     0x0
#define _SDFLC_FLC_POSITION                                 0x0
#define _SDFLC_FLC_SIZE                                     0x5
#define _SDFLC_FLC_LENGTH                                   0x5
#define _SDFLC_FLC_MASK                                     0x1F
#define _SDFLC_FLC0_POSN                                    0x0
#define _SDFLC_FLC0_POSITION                                0x0
#define _SDFLC_FLC0_SIZE                                    0x1
#define _SDFLC_FLC0_LENGTH                                  0x1
#define _SDFLC_FLC0_MASK                                    0x1
#define _SDFLC_FLC1_POSN                                    0x1
#define _SDFLC_FLC1_POSITION                                0x1
#define _SDFLC_FLC1_SIZE                                    0x1
#define _SDFLC_FLC1_LENGTH                                  0x1
#define _SDFLC_FLC1_MASK                                    0x2
#define _SDFLC_FLC2_POSN                                    0x2
#define _SDFLC_FLC2_POSITION                                0x2
#define _SDFLC_FLC2_SIZE                                    0x1
#define _SDFLC_FLC2_LENGTH                                  0x1
#define _SDFLC_FLC2_MASK                                    0x4
#define _SDFLC_FLC3_POSN                                    0x3
#define _SDFLC_FLC3_POSITION                                0x3
#define _SDFLC_FLC3_SIZE                                    0x1
#define _SDFLC_FLC3_LENGTH                                  0x1
#define _SDFLC_FLC3_MASK                                    0x8
#define _SDFLC_FLC4_POSN                                    0x4
#define _SDFLC_FLC4_POSITION                                0x4
#define _SDFLC_FLC4_SIZE                                    0x1
#define _SDFLC_FLC4_LENGTH                                  0x1
#define _SDFLC_FLC4_MASK                                    0x10

// Register: RXFBCON0
#define RXFBCON0 RXFBCON0
extern volatile unsigned char           RXFBCON0            __at(0xE71);
#ifndef _LIB_BUILD
asm("RXFBCON0 equ 0E71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned F0BP                   :4;
        unsigned F1BP                   :4;
    };
    struct {
        unsigned F0BP_0                 :1;
        unsigned F0BP_1                 :1;
        unsigned F0BP_2                 :1;
        unsigned F0BP_3                 :1;
        unsigned F1BP_0                 :1;
        unsigned F1BP_1                 :1;
        unsigned F1BP_2                 :1;
        unsigned F1BP_3                 :1;
    };
    struct {
        unsigned F0BP_01                :1;
    };
} RXFBCON0bits_t;
extern volatile RXFBCON0bits_t RXFBCON0bits __at(0xE71);
// bitfield macros
#define _RXFBCON0_F0BP_POSN                                 0x0
#define _RXFBCON0_F0BP_POSITION                             0x0
#define _RXFBCON0_F0BP_SIZE                                 0x4
#define _RXFBCON0_F0BP_LENGTH                               0x4
#define _RXFBCON0_F0BP_MASK                                 0xF
#define _RXFBCON0_F1BP_POSN                                 0x4
#define _RXFBCON0_F1BP_POSITION                             0x4
#define _RXFBCON0_F1BP_SIZE                                 0x4
#define _RXFBCON0_F1BP_LENGTH                               0x4
#define _RXFBCON0_F1BP_MASK                                 0xF0
#define _RXFBCON0_F0BP_0_POSN                               0x0
#define _RXFBCON0_F0BP_0_POSITION                           0x0
#define _RXFBCON0_F0BP_0_SIZE                               0x1
#define _RXFBCON0_F0BP_0_LENGTH                             0x1
#define _RXFBCON0_F0BP_0_MASK                               0x1
#define _RXFBCON0_F0BP_1_POSN                               0x1
#define _RXFBCON0_F0BP_1_POSITION                           0x1
#define _RXFBCON0_F0BP_1_SIZE                               0x1
#define _RXFBCON0_F0BP_1_LENGTH                             0x1
#define _RXFBCON0_F0BP_1_MASK                               0x2
#define _RXFBCON0_F0BP_2_POSN                               0x2
#define _RXFBCON0_F0BP_2_POSITION                           0x2
#define _RXFBCON0_F0BP_2_SIZE                               0x1
#define _RXFBCON0_F0BP_2_LENGTH                             0x1
#define _RXFBCON0_F0BP_2_MASK                               0x4
#define _RXFBCON0_F0BP_3_POSN                               0x3
#define _RXFBCON0_F0BP_3_POSITION                           0x3
#define _RXFBCON0_F0BP_3_SIZE                               0x1
#define _RXFBCON0_F0BP_3_LENGTH                             0x1
#define _RXFBCON0_F0BP_3_MASK                               0x8
#define _RXFBCON0_F1BP_0_POSN                               0x4
#define _RXFBCON0_F1BP_0_POSITION                           0x4
#define _RXFBCON0_F1BP_0_SIZE                               0x1
#define _RXFBCON0_F1BP_0_LENGTH                             0x1
#define _RXFBCON0_F1BP_0_MASK                               0x10
#define _RXFBCON0_F1BP_1_POSN                               0x5
#define _RXFBCON0_F1BP_1_POSITION                           0x5
#define _RXFBCON0_F1BP_1_SIZE                               0x1
#define _RXFBCON0_F1BP_1_LENGTH                             0x1
#define _RXFBCON0_F1BP_1_MASK                               0x20
#define _RXFBCON0_F1BP_2_POSN                               0x6
#define _RXFBCON0_F1BP_2_POSITION                           0x6
#define _RXFBCON0_F1BP_2_SIZE                               0x1
#define _RXFBCON0_F1BP_2_LENGTH                             0x1
#define _RXFBCON0_F1BP_2_MASK                               0x40
#define _RXFBCON0_F1BP_3_POSN                               0x7
#define _RXFBCON0_F1BP_3_POSITION                           0x7
#define _RXFBCON0_F1BP_3_SIZE                               0x1
#define _RXFBCON0_F1BP_3_LENGTH                             0x1
#define _RXFBCON0_F1BP_3_MASK                               0x80
#define _RXFBCON0_F0BP_01_POSN                              0x0
#define _RXFBCON0_F0BP_01_POSITION                          0x0
#define _RXFBCON0_F0BP_01_SIZE                              0x1
#define _RXFBCON0_F0BP_01_LENGTH                            0x1
#define _RXFBCON0_F0BP_01_MASK                              0x1

