MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K80/mcu.h
extern volatile B1EIDLbits_t B1EIDLbits __at(0xE94);
// bitfield macros
#define _B1EIDL_EID_POSN                                    0x0
#define _B1EIDL_EID_POSITION                                0x0
#define _B1EIDL_EID_SIZE                                    0x8
#define _B1EIDL_EID_LENGTH                                  0x8
#define _B1EIDL_EID_MASK                                    0xFF
#define _B1EIDL_EID0_POSN                                   0x0
#define _B1EIDL_EID0_POSITION                               0x0
#define _B1EIDL_EID0_SIZE                                   0x1
#define _B1EIDL_EID0_LENGTH                                 0x1
#define _B1EIDL_EID0_MASK                                   0x1
#define _B1EIDL_EID1_POSN                                   0x1
#define _B1EIDL_EID1_POSITION                               0x1
#define _B1EIDL_EID1_SIZE                                   0x1
#define _B1EIDL_EID1_LENGTH                                 0x1
#define _B1EIDL_EID1_MASK                                   0x2
#define _B1EIDL_EID2_POSN                                   0x2
#define _B1EIDL_EID2_POSITION                               0x2
#define _B1EIDL_EID2_SIZE                                   0x1
#define _B1EIDL_EID2_LENGTH                                 0x1
#define _B1EIDL_EID2_MASK                                   0x4
#define _B1EIDL_EID3_POSN                                   0x3
#define _B1EIDL_EID3_POSITION                               0x3
#define _B1EIDL_EID3_SIZE                                   0x1
#define _B1EIDL_EID3_LENGTH                                 0x1
#define _B1EIDL_EID3_MASK                                   0x8
#define _B1EIDL_EID4_POSN                                   0x4
#define _B1EIDL_EID4_POSITION                               0x4
#define _B1EIDL_EID4_SIZE                                   0x1
#define _B1EIDL_EID4_LENGTH                                 0x1
#define _B1EIDL_EID4_MASK                                   0x10
#define _B1EIDL_EID5_POSN                                   0x5
#define _B1EIDL_EID5_POSITION                               0x5
#define _B1EIDL_EID5_SIZE                                   0x1
#define _B1EIDL_EID5_LENGTH                                 0x1
#define _B1EIDL_EID5_MASK                                   0x20
#define _B1EIDL_EID6_POSN                                   0x6
#define _B1EIDL_EID6_POSITION                               0x6
#define _B1EIDL_EID6_SIZE                                   0x1
#define _B1EIDL_EID6_LENGTH                                 0x1
#define _B1EIDL_EID6_MASK                                   0x40
#define _B1EIDL_EID7_POSN                                   0x7
#define _B1EIDL_EID7_POSITION                               0x7
#define _B1EIDL_EID7_SIZE                                   0x1
#define _B1EIDL_EID7_LENGTH                                 0x1
#define _B1EIDL_EID7_MASK                                   0x80
#define _B1EIDL_B1EID0_POSN                                 0x0
#define _B1EIDL_B1EID0_POSITION                             0x0
#define _B1EIDL_B1EID0_SIZE                                 0x1
#define _B1EIDL_B1EID0_LENGTH                               0x1
#define _B1EIDL_B1EID0_MASK                                 0x1
#define _B1EIDL_B1EID1_POSN                                 0x1
#define _B1EIDL_B1EID1_POSITION                             0x1
#define _B1EIDL_B1EID1_SIZE                                 0x1
#define _B1EIDL_B1EID1_LENGTH                               0x1
#define _B1EIDL_B1EID1_MASK                                 0x2
#define _B1EIDL_B1EID2_POSN                                 0x2
#define _B1EIDL_B1EID2_POSITION                             0x2
#define _B1EIDL_B1EID2_SIZE                                 0x1
#define _B1EIDL_B1EID2_LENGTH                               0x1
#define _B1EIDL_B1EID2_MASK                                 0x4
#define _B1EIDL_B1EID3_POSN                                 0x3
#define _B1EIDL_B1EID3_POSITION                             0x3
#define _B1EIDL_B1EID3_SIZE                                 0x1
#define _B1EIDL_B1EID3_LENGTH                               0x1
#define _B1EIDL_B1EID3_MASK                                 0x8
#define _B1EIDL_B1EID4_POSN                                 0x4
#define _B1EIDL_B1EID4_POSITION                             0x4
#define _B1EIDL_B1EID4_SIZE                                 0x1
#define _B1EIDL_B1EID4_LENGTH                               0x1
#define _B1EIDL_B1EID4_MASK                                 0x10
#define _B1EIDL_B1EID5_POSN                                 0x5
#define _B1EIDL_B1EID5_POSITION                             0x5
#define _B1EIDL_B1EID5_SIZE                                 0x1
#define _B1EIDL_B1EID5_LENGTH                               0x1
#define _B1EIDL_B1EID5_MASK                                 0x20
#define _B1EIDL_B1EID6_POSN                                 0x6
#define _B1EIDL_B1EID6_POSITION                             0x6
#define _B1EIDL_B1EID6_SIZE                                 0x1
#define _B1EIDL_B1EID6_LENGTH                               0x1
#define _B1EIDL_B1EID6_MASK                                 0x40
#define _B1EIDL_B1EID7_POSN                                 0x7
#define _B1EIDL_B1EID7_POSITION                             0x7
#define _B1EIDL_B1EID7_SIZE                                 0x1
#define _B1EIDL_B1EID7_LENGTH                               0x1
#define _B1EIDL_B1EID7_MASK                                 0x80

// Register: B1DLC
#define B1DLC B1DLC
extern volatile unsigned char           B1DLC               __at(0xE95);
#ifndef _LIB_BUILD
asm("B1DLC equ 0E95h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC                    :4;
        unsigned RB                     :2;
        unsigned RXRTR_TXRTR            :1;
    };
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RXRTR                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned TXRTR                  :1;
    };
    struct {
        unsigned B1DLC0                 :1;
        unsigned B1DLC1                 :1;
        unsigned B1DLC2                 :1;
        unsigned B1DLC3                 :1;
        unsigned B1RB0                  :1;
        unsigned B1RB1                  :1;
        unsigned B1RXRTR                :1;
    };
} B1DLCbits_t;
extern volatile B1DLCbits_t B1DLCbits __at(0xE95);
// bitfield macros
#define _B1DLC_DLC_POSN                                     0x0
#define _B1DLC_DLC_POSITION                                 0x0
#define _B1DLC_DLC_SIZE                                     0x4
#define _B1DLC_DLC_LENGTH                                   0x4
#define _B1DLC_DLC_MASK                                     0xF
#define _B1DLC_RB_POSN                                      0x4
#define _B1DLC_RB_POSITION                                  0x4
#define _B1DLC_RB_SIZE                                      0x2
#define _B1DLC_RB_LENGTH                                    0x2
#define _B1DLC_RB_MASK                                      0x30
#define _B1DLC_RXRTR_TXRTR_POSN                             0x6
#define _B1DLC_RXRTR_TXRTR_POSITION                         0x6
#define _B1DLC_RXRTR_TXRTR_SIZE                             0x1
#define _B1DLC_RXRTR_TXRTR_LENGTH                           0x1
#define _B1DLC_RXRTR_TXRTR_MASK                             0x40
#define _B1DLC_DLC0_POSN                                    0x0
#define _B1DLC_DLC0_POSITION                                0x0
#define _B1DLC_DLC0_SIZE                                    0x1
#define _B1DLC_DLC0_LENGTH                                  0x1
#define _B1DLC_DLC0_MASK                                    0x1
#define _B1DLC_DLC1_POSN                                    0x1
#define _B1DLC_DLC1_POSITION                                0x1
#define _B1DLC_DLC1_SIZE                                    0x1
#define _B1DLC_DLC1_LENGTH                                  0x1
#define _B1DLC_DLC1_MASK                                    0x2
#define _B1DLC_DLC2_POSN                                    0x2
#define _B1DLC_DLC2_POSITION                                0x2
#define _B1DLC_DLC2_SIZE                                    0x1
#define _B1DLC_DLC2_LENGTH                                  0x1
#define _B1DLC_DLC2_MASK                                    0x4
#define _B1DLC_DLC3_POSN                                    0x3
#define _B1DLC_DLC3_POSITION                                0x3
#define _B1DLC_DLC3_SIZE                                    0x1
#define _B1DLC_DLC3_LENGTH                                  0x1
#define _B1DLC_DLC3_MASK                                    0x8
#define _B1DLC_RB0_POSN                                     0x4
#define _B1DLC_RB0_POSITION                                 0x4
#define _B1DLC_RB0_SIZE                                     0x1
#define _B1DLC_RB0_LENGTH                                   0x1
#define _B1DLC_RB0_MASK                                     0x10
#define _B1DLC_RB1_POSN                                     0x5
#define _B1DLC_RB1_POSITION                                 0x5
#define _B1DLC_RB1_SIZE                                     0x1
#define _B1DLC_RB1_LENGTH                                   0x1
#define _B1DLC_RB1_MASK                                     0x20
#define _B1DLC_RXRTR_POSN                                   0x6
#define _B1DLC_RXRTR_POSITION                               0x6
#define _B1DLC_RXRTR_SIZE                                   0x1
#define _B1DLC_RXRTR_LENGTH                                 0x1
#define _B1DLC_RXRTR_MASK                                   0x40
#define _B1DLC_TXRTR_POSN                                   0x6
#define _B1DLC_TXRTR_POSITION                               0x6
#define _B1DLC_TXRTR_SIZE                                   0x1
#define _B1DLC_TXRTR_LENGTH                                 0x1
#define _B1DLC_TXRTR_MASK                                   0x40
#define _B1DLC_B1DLC0_POSN                                  0x0
#define _B1DLC_B1DLC0_POSITION                              0x0
#define _B1DLC_B1DLC0_SIZE                                  0x1
#define _B1DLC_B1DLC0_LENGTH                                0x1
#define _B1DLC_B1DLC0_MASK                                  0x1
#define _B1DLC_B1DLC1_POSN                                  0x1
#define _B1DLC_B1DLC1_POSITION                              0x1
#define _B1DLC_B1DLC1_SIZE                                  0x1
#define _B1DLC_B1DLC1_LENGTH                                0x1
#define _B1DLC_B1DLC1_MASK                                  0x2
#define _B1DLC_B1DLC2_POSN                                  0x2
#define _B1DLC_B1DLC2_POSITION                              0x2
#define _B1DLC_B1DLC2_SIZE                                  0x1
#define _B1DLC_B1DLC2_LENGTH                                0x1
#define _B1DLC_B1DLC2_MASK                                  0x4
#define _B1DLC_B1DLC3_POSN                                  0x3
#define _B1DLC_B1DLC3_POSITION                              0x3
#define _B1DLC_B1DLC3_SIZE                                  0x1
#define _B1DLC_B1DLC3_LENGTH                                0x1
#define _B1DLC_B1DLC3_MASK                                  0x8
#define _B1DLC_B1RB0_POSN                                   0x4
#define _B1DLC_B1RB0_POSITION                               0x4
#define _B1DLC_B1RB0_SIZE                                   0x1
#define _B1DLC_B1RB0_LENGTH                                 0x1
#define _B1DLC_B1RB0_MASK                                   0x10
#define _B1DLC_B1RB1_POSN                                   0x5
#define _B1DLC_B1RB1_POSITION                               0x5
#define _B1DLC_B1RB1_SIZE                                   0x1
#define _B1DLC_B1RB1_LENGTH                                 0x1
#define _B1DLC_B1RB1_MASK                                   0x20
#define _B1DLC_B1RXRTR_POSN                                 0x6
#define _B1DLC_B1RXRTR_POSITION                             0x6
#define _B1DLC_B1RXRTR_SIZE                                 0x1
#define _B1DLC_B1RXRTR_LENGTH                               0x1
#define _B1DLC_B1RXRTR_MASK                                 0x40

