MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K80/mcu.h
// Register: B3D3
#define B3D3 B3D3
extern volatile unsigned char           B3D3                __at(0xEB9);
#ifndef _LIB_BUILD
asm("B3D3 equ 0EB9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B3D3                   :8;
    };
    struct {
        unsigned B3D30                  :1;
        unsigned B3D31                  :1;
        unsigned B3D32                  :1;
        unsigned B3D33                  :1;
        unsigned B3D34                  :1;
        unsigned B3D35                  :1;
        unsigned B3D36                  :1;
        unsigned B3D37                  :1;
    };
} B3D3bits_t;
extern volatile B3D3bits_t B3D3bits __at(0xEB9);
// bitfield macros
#define _B3D3_B3D3_POSN                                     0x0
#define _B3D3_B3D3_POSITION                                 0x0
#define _B3D3_B3D3_SIZE                                     0x8
#define _B3D3_B3D3_LENGTH                                   0x8
#define _B3D3_B3D3_MASK                                     0xFF
#define _B3D3_B3D30_POSN                                    0x0
#define _B3D3_B3D30_POSITION                                0x0
#define _B3D3_B3D30_SIZE                                    0x1
#define _B3D3_B3D30_LENGTH                                  0x1
#define _B3D3_B3D30_MASK                                    0x1
#define _B3D3_B3D31_POSN                                    0x1
#define _B3D3_B3D31_POSITION                                0x1
#define _B3D3_B3D31_SIZE                                    0x1
#define _B3D3_B3D31_LENGTH                                  0x1
#define _B3D3_B3D31_MASK                                    0x2
#define _B3D3_B3D32_POSN                                    0x2
#define _B3D3_B3D32_POSITION                                0x2
#define _B3D3_B3D32_SIZE                                    0x1
#define _B3D3_B3D32_LENGTH                                  0x1
#define _B3D3_B3D32_MASK                                    0x4
#define _B3D3_B3D33_POSN                                    0x3
#define _B3D3_B3D33_POSITION                                0x3
#define _B3D3_B3D33_SIZE                                    0x1
#define _B3D3_B3D33_LENGTH                                  0x1
#define _B3D3_B3D33_MASK                                    0x8
#define _B3D3_B3D34_POSN                                    0x4
#define _B3D3_B3D34_POSITION                                0x4
#define _B3D3_B3D34_SIZE                                    0x1
#define _B3D3_B3D34_LENGTH                                  0x1
#define _B3D3_B3D34_MASK                                    0x10
#define _B3D3_B3D35_POSN                                    0x5
#define _B3D3_B3D35_POSITION                                0x5
#define _B3D3_B3D35_SIZE                                    0x1
#define _B3D3_B3D35_LENGTH                                  0x1
#define _B3D3_B3D35_MASK                                    0x20
#define _B3D3_B3D36_POSN                                    0x6
#define _B3D3_B3D36_POSITION                                0x6
#define _B3D3_B3D36_SIZE                                    0x1
#define _B3D3_B3D36_LENGTH                                  0x1
#define _B3D3_B3D36_MASK                                    0x40
#define _B3D3_B3D37_POSN                                    0x7
#define _B3D3_B3D37_POSITION                                0x7
#define _B3D3_B3D37_SIZE                                    0x1
#define _B3D3_B3D37_LENGTH                                  0x1
#define _B3D3_B3D37_MASK                                    0x80

// Register: B3D4
#define B3D4 B3D4
extern volatile unsigned char           B3D4                __at(0xEBA);
#ifndef _LIB_BUILD
asm("B3D4 equ 0EBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B3D4                   :8;
    };
    struct {
        unsigned B3D40                  :1;
        unsigned B3D41                  :1;
        unsigned B3D42                  :1;
        unsigned B3D43                  :1;
        unsigned B3D44                  :1;
        unsigned B3D45                  :1;
        unsigned B3D46                  :1;
        unsigned B3D47                  :1;
    };
} B3D4bits_t;
extern volatile B3D4bits_t B3D4bits __at(0xEBA);
// bitfield macros
#define _B3D4_B3D4_POSN                                     0x0
#define _B3D4_B3D4_POSITION                                 0x0
#define _B3D4_B3D4_SIZE                                     0x8
#define _B3D4_B3D4_LENGTH                                   0x8
#define _B3D4_B3D4_MASK                                     0xFF
#define _B3D4_B3D40_POSN                                    0x0
#define _B3D4_B3D40_POSITION                                0x0
#define _B3D4_B3D40_SIZE                                    0x1
#define _B3D4_B3D40_LENGTH                                  0x1
#define _B3D4_B3D40_MASK                                    0x1
#define _B3D4_B3D41_POSN                                    0x1
#define _B3D4_B3D41_POSITION                                0x1
#define _B3D4_B3D41_SIZE                                    0x1
#define _B3D4_B3D41_LENGTH                                  0x1
#define _B3D4_B3D41_MASK                                    0x2
#define _B3D4_B3D42_POSN                                    0x2
#define _B3D4_B3D42_POSITION                                0x2
#define _B3D4_B3D42_SIZE                                    0x1
#define _B3D4_B3D42_LENGTH                                  0x1
#define _B3D4_B3D42_MASK                                    0x4
#define _B3D4_B3D43_POSN                                    0x3
#define _B3D4_B3D43_POSITION                                0x3
#define _B3D4_B3D43_SIZE                                    0x1
#define _B3D4_B3D43_LENGTH                                  0x1
#define _B3D4_B3D43_MASK                                    0x8
#define _B3D4_B3D44_POSN                                    0x4
#define _B3D4_B3D44_POSITION                                0x4
#define _B3D4_B3D44_SIZE                                    0x1
#define _B3D4_B3D44_LENGTH                                  0x1
#define _B3D4_B3D44_MASK                                    0x10
#define _B3D4_B3D45_POSN                                    0x5
#define _B3D4_B3D45_POSITION                                0x5
#define _B3D4_B3D45_SIZE                                    0x1
#define _B3D4_B3D45_LENGTH                                  0x1
#define _B3D4_B3D45_MASK                                    0x20
#define _B3D4_B3D46_POSN                                    0x6
#define _B3D4_B3D46_POSITION                                0x6
#define _B3D4_B3D46_SIZE                                    0x1
#define _B3D4_B3D46_LENGTH                                  0x1
#define _B3D4_B3D46_MASK                                    0x40
#define _B3D4_B3D47_POSN                                    0x7
#define _B3D4_B3D47_POSITION                                0x7
#define _B3D4_B3D47_SIZE                                    0x1
#define _B3D4_B3D47_LENGTH                                  0x1
#define _B3D4_B3D47_MASK                                    0x80

// Register: B3D5
#define B3D5 B3D5
extern volatile unsigned char           B3D5                __at(0xEBB);
#ifndef _LIB_BUILD
asm("B3D5 equ 0EBBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B3D5                   :8;
    };
    struct {
        unsigned B3D50                  :1;
        unsigned B3D51                  :1;
        unsigned B3D52                  :1;
        unsigned B3D53                  :1;
        unsigned B3D54                  :1;
        unsigned B3D55                  :1;
        unsigned B3D56                  :1;
        unsigned B3D57                  :1;
    };
} B3D5bits_t;
extern volatile B3D5bits_t B3D5bits __at(0xEBB);
// bitfield macros
#define _B3D5_B3D5_POSN                                     0x0
#define _B3D5_B3D5_POSITION                                 0x0
#define _B3D5_B3D5_SIZE                                     0x8
#define _B3D5_B3D5_LENGTH                                   0x8
#define _B3D5_B3D5_MASK                                     0xFF
#define _B3D5_B3D50_POSN                                    0x0
#define _B3D5_B3D50_POSITION                                0x0
#define _B3D5_B3D50_SIZE                                    0x1
#define _B3D5_B3D50_LENGTH                                  0x1
#define _B3D5_B3D50_MASK                                    0x1
#define _B3D5_B3D51_POSN                                    0x1
#define _B3D5_B3D51_POSITION                                0x1
#define _B3D5_B3D51_SIZE                                    0x1
#define _B3D5_B3D51_LENGTH                                  0x1
#define _B3D5_B3D51_MASK                                    0x2
#define _B3D5_B3D52_POSN                                    0x2
#define _B3D5_B3D52_POSITION                                0x2
#define _B3D5_B3D52_SIZE                                    0x1
#define _B3D5_B3D52_LENGTH                                  0x1
#define _B3D5_B3D52_MASK                                    0x4
#define _B3D5_B3D53_POSN                                    0x3
#define _B3D5_B3D53_POSITION                                0x3
#define _B3D5_B3D53_SIZE                                    0x1
#define _B3D5_B3D53_LENGTH                                  0x1
#define _B3D5_B3D53_MASK                                    0x8
#define _B3D5_B3D54_POSN                                    0x4
#define _B3D5_B3D54_POSITION                                0x4
#define _B3D5_B3D54_SIZE                                    0x1
#define _B3D5_B3D54_LENGTH                                  0x1
#define _B3D5_B3D54_MASK                                    0x10
#define _B3D5_B3D55_POSN                                    0x5
#define _B3D5_B3D55_POSITION                                0x5
#define _B3D5_B3D55_SIZE                                    0x1
#define _B3D5_B3D55_LENGTH                                  0x1
#define _B3D5_B3D55_MASK                                    0x20
#define _B3D5_B3D56_POSN                                    0x6
#define _B3D5_B3D56_POSITION                                0x6
#define _B3D5_B3D56_SIZE                                    0x1
#define _B3D5_B3D56_LENGTH                                  0x1
#define _B3D5_B3D56_MASK                                    0x40
#define _B3D5_B3D57_POSN                                    0x7
#define _B3D5_B3D57_POSITION                                0x7
#define _B3D5_B3D57_SIZE                                    0x1
#define _B3D5_B3D57_LENGTH                                  0x1
#define _B3D5_B3D57_MASK                                    0x80

// Register: B3D6
#define B3D6 B3D6
extern volatile unsigned char           B3D6                __at(0xEBC);
#ifndef _LIB_BUILD
asm("B3D6 equ 0EBCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B3D6                   :8;
    };
    struct {
        unsigned B3D60                  :1;
        unsigned B3D61                  :1;
        unsigned B3D62                  :1;
        unsigned B3D63                  :1;
        unsigned B3D64                  :1;
        unsigned B3D65                  :1;
        unsigned B3D66                  :1;
        unsigned B3D67                  :1;
    };
} B3D6bits_t;
extern volatile B3D6bits_t B3D6bits __at(0xEBC);
// bitfield macros
#define _B3D6_B3D6_POSN                                     0x0
#define _B3D6_B3D6_POSITION                                 0x0
#define _B3D6_B3D6_SIZE                                     0x8
#define _B3D6_B3D6_LENGTH                                   0x8
#define _B3D6_B3D6_MASK                                     0xFF
#define _B3D6_B3D60_POSN                                    0x0
#define _B3D6_B3D60_POSITION                                0x0
#define _B3D6_B3D60_SIZE                                    0x1
#define _B3D6_B3D60_LENGTH                                  0x1
#define _B3D6_B3D60_MASK                                    0x1
#define _B3D6_B3D61_POSN                                    0x1
#define _B3D6_B3D61_POSITION                                0x1
#define _B3D6_B3D61_SIZE                                    0x1
#define _B3D6_B3D61_LENGTH                                  0x1
#define _B3D6_B3D61_MASK                                    0x2
#define _B3D6_B3D62_POSN                                    0x2
#define _B3D6_B3D62_POSITION                                0x2
#define _B3D6_B3D62_SIZE                                    0x1
#define _B3D6_B3D62_LENGTH                                  0x1
#define _B3D6_B3D62_MASK                                    0x4
#define _B3D6_B3D63_POSN                                    0x3
#define _B3D6_B3D63_POSITION                                0x3
#define _B3D6_B3D63_SIZE                                    0x1
#define _B3D6_B3D63_LENGTH                                  0x1
#define _B3D6_B3D63_MASK                                    0x8
#define _B3D6_B3D64_POSN                                    0x4
#define _B3D6_B3D64_POSITION                                0x4
#define _B3D6_B3D64_SIZE                                    0x1
#define _B3D6_B3D64_LENGTH                                  0x1
#define _B3D6_B3D64_MASK                                    0x10
#define _B3D6_B3D65_POSN                                    0x5
#define _B3D6_B3D65_POSITION                                0x5
#define _B3D6_B3D65_SIZE                                    0x1
#define _B3D6_B3D65_LENGTH                                  0x1
#define _B3D6_B3D65_MASK                                    0x20
#define _B3D6_B3D66_POSN                                    0x6
#define _B3D6_B3D66_POSITION                                0x6
#define _B3D6_B3D66_SIZE                                    0x1
#define _B3D6_B3D66_LENGTH                                  0x1
#define _B3D6_B3D66_MASK                                    0x40
#define _B3D6_B3D67_POSN                                    0x7
#define _B3D6_B3D67_POSITION                                0x7
#define _B3D6_B3D67_SIZE                                    0x1
#define _B3D6_B3D67_LENGTH                                  0x1
#define _B3D6_B3D67_MASK                                    0x80

// Register: B3D7
#define B3D7 B3D7
extern volatile unsigned char           B3D7                __at(0xEBD);
#ifndef _LIB_BUILD
asm("B3D7 equ 0EBDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B3D7                   :8;
    };
    struct {
        unsigned B3D70                  :1;
        unsigned B3D71                  :1;
        unsigned B3D72                  :1;
        unsigned B3D73                  :1;
        unsigned B3D74                  :1;
        unsigned B3D75                  :1;
        unsigned B3D76                  :1;
        unsigned B3D77                  :1;
    };
} B3D7bits_t;
extern volatile B3D7bits_t B3D7bits __at(0xEBD);
// bitfield macros
#define _B3D7_B3D7_POSN                                     0x0
#define _B3D7_B3D7_POSITION                                 0x0
#define _B3D7_B3D7_SIZE                                     0x8
#define _B3D7_B3D7_LENGTH                                   0x8
#define _B3D7_B3D7_MASK                                     0xFF
#define _B3D7_B3D70_POSN                                    0x0
#define _B3D7_B3D70_POSITION                                0x0
#define _B3D7_B3D70_SIZE                                    0x1
#define _B3D7_B3D70_LENGTH                                  0x1
#define _B3D7_B3D70_MASK                                    0x1
#define _B3D7_B3D71_POSN                                    0x1
#define _B3D7_B3D71_POSITION                                0x1
#define _B3D7_B3D71_SIZE                                    0x1
#define _B3D7_B3D71_LENGTH                                  0x1
#define _B3D7_B3D71_MASK                                    0x2
#define _B3D7_B3D72_POSN                                    0x2
#define _B3D7_B3D72_POSITION                                0x2
#define _B3D7_B3D72_SIZE                                    0x1
#define _B3D7_B3D72_LENGTH                                  0x1
#define _B3D7_B3D72_MASK                                    0x4
#define _B3D7_B3D73_POSN                                    0x3
#define _B3D7_B3D73_POSITION                                0x3
#define _B3D7_B3D73_SIZE                                    0x1
#define _B3D7_B3D73_LENGTH                                  0x1
#define _B3D7_B3D73_MASK                                    0x8
#define _B3D7_B3D74_POSN                                    0x4
#define _B3D7_B3D74_POSITION                                0x4
#define _B3D7_B3D74_SIZE                                    0x1
#define _B3D7_B3D74_LENGTH                                  0x1
#define _B3D7_B3D74_MASK                                    0x10
#define _B3D7_B3D75_POSN                                    0x5
#define _B3D7_B3D75_POSITION                                0x5
#define _B3D7_B3D75_SIZE                                    0x1
#define _B3D7_B3D75_LENGTH                                  0x1
#define _B3D7_B3D75_MASK                                    0x20
#define _B3D7_B3D76_POSN                                    0x6
#define _B3D7_B3D76_POSITION                                0x6
#define _B3D7_B3D76_SIZE                                    0x1
#define _B3D7_B3D76_LENGTH                                  0x1
#define _B3D7_B3D76_MASK                                    0x40
#define _B3D7_B3D77_POSN                                    0x7
#define _B3D7_B3D77_POSITION                                0x7
#define _B3D7_B3D77_SIZE                                    0x1
#define _B3D7_B3D77_LENGTH                                  0x1
#define _B3D7_B3D77_MASK                                    0x80

// Register: CANSTAT_RO6
#define CANSTAT_RO6 CANSTAT_RO6
extern volatile unsigned char           CANSTAT_RO6         __at(0xEBE);
#ifndef _LIB_BUILD
asm("CANSTAT_RO6 equ 0EBEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EICODE0                :1;
        unsigned EICODE1_ICODE0         :1;
        unsigned EICODE2_ICODE1         :1;
        unsigned EICODE3_ICODE2         :1;
        unsigned EICODE4                :1;
        unsigned OPMODE                 :3;
    };
    struct {
        unsigned                        :1;
        unsigned EICODE1                :1;
        unsigned EICODE2                :1;
        unsigned EICODE3                :1;
        unsigned                        :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
    struct {
        unsigned                        :1;
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
    };
} CANSTAT_RO6bits_t;
extern volatile CANSTAT_RO6bits_t CANSTAT_RO6bits __at(0xEBE);
// bitfield macros
#define _CANSTAT_RO6_EICODE0_POSN                           0x0
#define _CANSTAT_RO6_EICODE0_POSITION                       0x0
#define _CANSTAT_RO6_EICODE0_SIZE                           0x1
#define _CANSTAT_RO6_EICODE0_LENGTH                         0x1
#define _CANSTAT_RO6_EICODE0_MASK                           0x1
#define _CANSTAT_RO6_EICODE1_ICODE0_POSN                    0x1
#define _CANSTAT_RO6_EICODE1_ICODE0_POSITION                0x1
#define _CANSTAT_RO6_EICODE1_ICODE0_SIZE                    0x1
#define _CANSTAT_RO6_EICODE1_ICODE0_LENGTH                  0x1
#define _CANSTAT_RO6_EICODE1_ICODE0_MASK                    0x2
#define _CANSTAT_RO6_EICODE2_ICODE1_POSN                    0x2
#define _CANSTAT_RO6_EICODE2_ICODE1_POSITION                0x2
#define _CANSTAT_RO6_EICODE2_ICODE1_SIZE                    0x1
#define _CANSTAT_RO6_EICODE2_ICODE1_LENGTH                  0x1
#define _CANSTAT_RO6_EICODE2_ICODE1_MASK                    0x4
#define _CANSTAT_RO6_EICODE3_ICODE2_POSN                    0x3
#define _CANSTAT_RO6_EICODE3_ICODE2_POSITION                0x3
#define _CANSTAT_RO6_EICODE3_ICODE2_SIZE                    0x1
#define _CANSTAT_RO6_EICODE3_ICODE2_LENGTH                  0x1
#define _CANSTAT_RO6_EICODE3_ICODE2_MASK                    0x8
#define _CANSTAT_RO6_EICODE4_POSN                           0x4
#define _CANSTAT_RO6_EICODE4_POSITION                       0x4
#define _CANSTAT_RO6_EICODE4_SIZE                           0x1
#define _CANSTAT_RO6_EICODE4_LENGTH                         0x1
#define _CANSTAT_RO6_EICODE4_MASK                           0x10
#define _CANSTAT_RO6_OPMODE_POSN                            0x5
#define _CANSTAT_RO6_OPMODE_POSITION                        0x5
#define _CANSTAT_RO6_OPMODE_SIZE                            0x3
#define _CANSTAT_RO6_OPMODE_LENGTH                          0x3
#define _CANSTAT_RO6_OPMODE_MASK                            0xE0
#define _CANSTAT_RO6_EICODE1_POSN                           0x1
#define _CANSTAT_RO6_EICODE1_POSITION                       0x1
#define _CANSTAT_RO6_EICODE1_SIZE                           0x1
#define _CANSTAT_RO6_EICODE1_LENGTH                         0x1
#define _CANSTAT_RO6_EICODE1_MASK                           0x2
#define _CANSTAT_RO6_EICODE2_POSN                           0x2
#define _CANSTAT_RO6_EICODE2_POSITION                       0x2
#define _CANSTAT_RO6_EICODE2_SIZE                           0x1
#define _CANSTAT_RO6_EICODE2_LENGTH                         0x1
#define _CANSTAT_RO6_EICODE2_MASK                           0x4
#define _CANSTAT_RO6_EICODE3_POSN                           0x3
#define _CANSTAT_RO6_EICODE3_POSITION                       0x3
#define _CANSTAT_RO6_EICODE3_SIZE                           0x1
#define _CANSTAT_RO6_EICODE3_LENGTH                         0x1
#define _CANSTAT_RO6_EICODE3_MASK                           0x8
#define _CANSTAT_RO6_OPMODE0_POSN                           0x5
#define _CANSTAT_RO6_OPMODE0_POSITION                       0x5
#define _CANSTAT_RO6_OPMODE0_SIZE                           0x1
#define _CANSTAT_RO6_OPMODE0_LENGTH                         0x1
#define _CANSTAT_RO6_OPMODE0_MASK                           0x20
#define _CANSTAT_RO6_OPMODE1_POSN                           0x6
#define _CANSTAT_RO6_OPMODE1_POSITION                       0x6
#define _CANSTAT_RO6_OPMODE1_SIZE                           0x1
#define _CANSTAT_RO6_OPMODE1_LENGTH                         0x1
#define _CANSTAT_RO6_OPMODE1_MASK                           0x40
#define _CANSTAT_RO6_OPMODE2_POSN                           0x7
#define _CANSTAT_RO6_OPMODE2_POSITION                       0x7
#define _CANSTAT_RO6_OPMODE2_SIZE                           0x1
#define _CANSTAT_RO6_OPMODE2_LENGTH                         0x1
#define _CANSTAT_RO6_OPMODE2_MASK                           0x80
#define _CANSTAT_RO6_ICODE0_POSN                            0x1
#define _CANSTAT_RO6_ICODE0_POSITION                        0x1
#define _CANSTAT_RO6_ICODE0_SIZE                            0x1
#define _CANSTAT_RO6_ICODE0_LENGTH                          0x1
#define _CANSTAT_RO6_ICODE0_MASK                            0x2
#define _CANSTAT_RO6_ICODE1_POSN                            0x2
#define _CANSTAT_RO6_ICODE1_POSITION                        0x2
#define _CANSTAT_RO6_ICODE1_SIZE                            0x1
#define _CANSTAT_RO6_ICODE1_LENGTH                          0x1
#define _CANSTAT_RO6_ICODE1_MASK                            0x4
#define _CANSTAT_RO6_ICODE2_POSN                            0x3
#define _CANSTAT_RO6_ICODE2_POSITION                        0x3
#define _CANSTAT_RO6_ICODE2_SIZE                            0x1
#define _CANSTAT_RO6_ICODE2_LENGTH                          0x1
#define _CANSTAT_RO6_ICODE2_MASK                            0x8

