MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K80/mcu.h
// Register: RXF0EIDL
#define RXF0EIDL RXF0EIDL
extern volatile unsigned char           RXF0EIDL            __at(0xEE3);
#ifndef _LIB_BUILD
asm("RXF0EIDL equ 0EE3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF0EID0               :1;
        unsigned RXF0EID1               :1;
        unsigned RXF0EID2               :1;
        unsigned RXF0EID3               :1;
        unsigned RXF0EID4               :1;
        unsigned RXF0EID5               :1;
        unsigned RXF0EID6               :1;
        unsigned RXF0EID7               :1;
    };
} RXF0EIDLbits_t;
extern volatile RXF0EIDLbits_t RXF0EIDLbits __at(0xEE3);
// bitfield macros
#define _RXF0EIDL_EID_POSN                                  0x0
#define _RXF0EIDL_EID_POSITION                              0x0
#define _RXF0EIDL_EID_SIZE                                  0x8
#define _RXF0EIDL_EID_LENGTH                                0x8
#define _RXF0EIDL_EID_MASK                                  0xFF
#define _RXF0EIDL_EID0_POSN                                 0x0
#define _RXF0EIDL_EID0_POSITION                             0x0
#define _RXF0EIDL_EID0_SIZE                                 0x1
#define _RXF0EIDL_EID0_LENGTH                               0x1
#define _RXF0EIDL_EID0_MASK                                 0x1
#define _RXF0EIDL_EID1_POSN                                 0x1
#define _RXF0EIDL_EID1_POSITION                             0x1
#define _RXF0EIDL_EID1_SIZE                                 0x1
#define _RXF0EIDL_EID1_LENGTH                               0x1
#define _RXF0EIDL_EID1_MASK                                 0x2
#define _RXF0EIDL_EID2_POSN                                 0x2
#define _RXF0EIDL_EID2_POSITION                             0x2
#define _RXF0EIDL_EID2_SIZE                                 0x1
#define _RXF0EIDL_EID2_LENGTH                               0x1
#define _RXF0EIDL_EID2_MASK                                 0x4
#define _RXF0EIDL_EID3_POSN                                 0x3
#define _RXF0EIDL_EID3_POSITION                             0x3
#define _RXF0EIDL_EID3_SIZE                                 0x1
#define _RXF0EIDL_EID3_LENGTH                               0x1
#define _RXF0EIDL_EID3_MASK                                 0x8
#define _RXF0EIDL_EID4_POSN                                 0x4
#define _RXF0EIDL_EID4_POSITION                             0x4
#define _RXF0EIDL_EID4_SIZE                                 0x1
#define _RXF0EIDL_EID4_LENGTH                               0x1
#define _RXF0EIDL_EID4_MASK                                 0x10
#define _RXF0EIDL_EID5_POSN                                 0x5
#define _RXF0EIDL_EID5_POSITION                             0x5
#define _RXF0EIDL_EID5_SIZE                                 0x1
#define _RXF0EIDL_EID5_LENGTH                               0x1
#define _RXF0EIDL_EID5_MASK                                 0x20
#define _RXF0EIDL_EID6_POSN                                 0x6
#define _RXF0EIDL_EID6_POSITION                             0x6
#define _RXF0EIDL_EID6_SIZE                                 0x1
#define _RXF0EIDL_EID6_LENGTH                               0x1
#define _RXF0EIDL_EID6_MASK                                 0x40
#define _RXF0EIDL_EID7_POSN                                 0x7
#define _RXF0EIDL_EID7_POSITION                             0x7
#define _RXF0EIDL_EID7_SIZE                                 0x1
#define _RXF0EIDL_EID7_LENGTH                               0x1
#define _RXF0EIDL_EID7_MASK                                 0x80
#define _RXF0EIDL_RXF0EID0_POSN                             0x0
#define _RXF0EIDL_RXF0EID0_POSITION                         0x0
#define _RXF0EIDL_RXF0EID0_SIZE                             0x1
#define _RXF0EIDL_RXF0EID0_LENGTH                           0x1
#define _RXF0EIDL_RXF0EID0_MASK                             0x1
#define _RXF0EIDL_RXF0EID1_POSN                             0x1
#define _RXF0EIDL_RXF0EID1_POSITION                         0x1
#define _RXF0EIDL_RXF0EID1_SIZE                             0x1
#define _RXF0EIDL_RXF0EID1_LENGTH                           0x1
#define _RXF0EIDL_RXF0EID1_MASK                             0x2
#define _RXF0EIDL_RXF0EID2_POSN                             0x2
#define _RXF0EIDL_RXF0EID2_POSITION                         0x2
#define _RXF0EIDL_RXF0EID2_SIZE                             0x1
#define _RXF0EIDL_RXF0EID2_LENGTH                           0x1
#define _RXF0EIDL_RXF0EID2_MASK                             0x4
#define _RXF0EIDL_RXF0EID3_POSN                             0x3
#define _RXF0EIDL_RXF0EID3_POSITION                         0x3
#define _RXF0EIDL_RXF0EID3_SIZE                             0x1
#define _RXF0EIDL_RXF0EID3_LENGTH                           0x1
#define _RXF0EIDL_RXF0EID3_MASK                             0x8
#define _RXF0EIDL_RXF0EID4_POSN                             0x4
#define _RXF0EIDL_RXF0EID4_POSITION                         0x4
#define _RXF0EIDL_RXF0EID4_SIZE                             0x1
#define _RXF0EIDL_RXF0EID4_LENGTH                           0x1
#define _RXF0EIDL_RXF0EID4_MASK                             0x10
#define _RXF0EIDL_RXF0EID5_POSN                             0x5
#define _RXF0EIDL_RXF0EID5_POSITION                         0x5
#define _RXF0EIDL_RXF0EID5_SIZE                             0x1
#define _RXF0EIDL_RXF0EID5_LENGTH                           0x1
#define _RXF0EIDL_RXF0EID5_MASK                             0x20
#define _RXF0EIDL_RXF0EID6_POSN                             0x6
#define _RXF0EIDL_RXF0EID6_POSITION                         0x6
#define _RXF0EIDL_RXF0EID6_SIZE                             0x1
#define _RXF0EIDL_RXF0EID6_LENGTH                           0x1
#define _RXF0EIDL_RXF0EID6_MASK                             0x40
#define _RXF0EIDL_RXF0EID7_POSN                             0x7
#define _RXF0EIDL_RXF0EID7_POSITION                         0x7
#define _RXF0EIDL_RXF0EID7_SIZE                             0x1
#define _RXF0EIDL_RXF0EID7_LENGTH                           0x1
#define _RXF0EIDL_RXF0EID7_MASK                             0x80

