MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K80/mcu.h
extern volatile RXM1SIDHbits_t RXM1SIDHbits __at(0xEFC);
// bitfield macros
#define _RXM1SIDH_SID_POSN                                  0x0
#define _RXM1SIDH_SID_POSITION                              0x0
#define _RXM1SIDH_SID_SIZE                                  0x8
#define _RXM1SIDH_SID_LENGTH                                0x8
#define _RXM1SIDH_SID_MASK                                  0xFF
#define _RXM1SIDH_SID3_POSN                                 0x0
#define _RXM1SIDH_SID3_POSITION                             0x0
#define _RXM1SIDH_SID3_SIZE                                 0x1
#define _RXM1SIDH_SID3_LENGTH                               0x1
#define _RXM1SIDH_SID3_MASK                                 0x1
#define _RXM1SIDH_SID4_POSN                                 0x1
#define _RXM1SIDH_SID4_POSITION                             0x1
#define _RXM1SIDH_SID4_SIZE                                 0x1
#define _RXM1SIDH_SID4_LENGTH                               0x1
#define _RXM1SIDH_SID4_MASK                                 0x2
#define _RXM1SIDH_SID5_POSN                                 0x2
#define _RXM1SIDH_SID5_POSITION                             0x2
#define _RXM1SIDH_SID5_SIZE                                 0x1
#define _RXM1SIDH_SID5_LENGTH                               0x1
#define _RXM1SIDH_SID5_MASK                                 0x4
#define _RXM1SIDH_SID6_POSN                                 0x3
#define _RXM1SIDH_SID6_POSITION                             0x3
#define _RXM1SIDH_SID6_SIZE                                 0x1
#define _RXM1SIDH_SID6_LENGTH                               0x1
#define _RXM1SIDH_SID6_MASK                                 0x8
#define _RXM1SIDH_SID7_POSN                                 0x4
#define _RXM1SIDH_SID7_POSITION                             0x4
#define _RXM1SIDH_SID7_SIZE                                 0x1
#define _RXM1SIDH_SID7_LENGTH                               0x1
#define _RXM1SIDH_SID7_MASK                                 0x10
#define _RXM1SIDH_SID8_POSN                                 0x5
#define _RXM1SIDH_SID8_POSITION                             0x5
#define _RXM1SIDH_SID8_SIZE                                 0x1
#define _RXM1SIDH_SID8_LENGTH                               0x1
#define _RXM1SIDH_SID8_MASK                                 0x20
#define _RXM1SIDH_SID9_POSN                                 0x6
#define _RXM1SIDH_SID9_POSITION                             0x6
#define _RXM1SIDH_SID9_SIZE                                 0x1
#define _RXM1SIDH_SID9_LENGTH                               0x1
#define _RXM1SIDH_SID9_MASK                                 0x40
#define _RXM1SIDH_SID10_POSN                                0x7
#define _RXM1SIDH_SID10_POSITION                            0x7
#define _RXM1SIDH_SID10_SIZE                                0x1
#define _RXM1SIDH_SID10_LENGTH                              0x1
#define _RXM1SIDH_SID10_MASK                                0x80
#define _RXM1SIDH_RXM1SID3_POSN                             0x0
#define _RXM1SIDH_RXM1SID3_POSITION                         0x0
#define _RXM1SIDH_RXM1SID3_SIZE                             0x1
#define _RXM1SIDH_RXM1SID3_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID3_MASK                             0x1
#define _RXM1SIDH_RXM1SID4_POSN                             0x1
#define _RXM1SIDH_RXM1SID4_POSITION                         0x1
#define _RXM1SIDH_RXM1SID4_SIZE                             0x1
#define _RXM1SIDH_RXM1SID4_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID4_MASK                             0x2
#define _RXM1SIDH_RXM1SID5_POSN                             0x2
#define _RXM1SIDH_RXM1SID5_POSITION                         0x2
#define _RXM1SIDH_RXM1SID5_SIZE                             0x1
#define _RXM1SIDH_RXM1SID5_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID5_MASK                             0x4
#define _RXM1SIDH_RXM1SID6_POSN                             0x3
#define _RXM1SIDH_RXM1SID6_POSITION                         0x3
#define _RXM1SIDH_RXM1SID6_SIZE                             0x1
#define _RXM1SIDH_RXM1SID6_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID6_MASK                             0x8
#define _RXM1SIDH_RXM1SID7_POSN                             0x4
#define _RXM1SIDH_RXM1SID7_POSITION                         0x4
#define _RXM1SIDH_RXM1SID7_SIZE                             0x1
#define _RXM1SIDH_RXM1SID7_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID7_MASK                             0x10
#define _RXM1SIDH_RXM1SID8_POSN                             0x5
#define _RXM1SIDH_RXM1SID8_POSITION                         0x5
#define _RXM1SIDH_RXM1SID8_SIZE                             0x1
#define _RXM1SIDH_RXM1SID8_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID8_MASK                             0x20
#define _RXM1SIDH_RXM1SID9_POSN                             0x6
#define _RXM1SIDH_RXM1SID9_POSITION                         0x6
#define _RXM1SIDH_RXM1SID9_SIZE                             0x1
#define _RXM1SIDH_RXM1SID9_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID9_MASK                             0x40
#define _RXM1SIDH_RXM1SID10_POSN                            0x7
#define _RXM1SIDH_RXM1SID10_POSITION                        0x7
#define _RXM1SIDH_RXM1SID10_SIZE                            0x1
#define _RXM1SIDH_RXM1SID10_LENGTH                          0x1
#define _RXM1SIDH_RXM1SID10_MASK                            0x80

// Register: RXM1SIDL
#define RXM1SIDL RXM1SIDL
extern volatile unsigned char           RXM1SIDL            __at(0xEFD);
#ifndef _LIB_BUILD
asm("RXM1SIDL equ 0EFDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXM1EID16              :1;
        unsigned RXM1EID17              :1;
        unsigned                        :1;
        unsigned RXM1EXIDEN             :1;
        unsigned                        :1;
        unsigned RXM1SID0               :1;
        unsigned RXM1SID1               :1;
        unsigned RXM1SID2               :1;
    };
} RXM1SIDLbits_t;
extern volatile RXM1SIDLbits_t RXM1SIDLbits __at(0xEFD);
// bitfield macros
#define _RXM1SIDL_EID_POSN                                  0x0
#define _RXM1SIDL_EID_POSITION                              0x0
#define _RXM1SIDL_EID_SIZE                                  0x2
#define _RXM1SIDL_EID_LENGTH                                0x2
#define _RXM1SIDL_EID_MASK                                  0x3
#define _RXM1SIDL_EXIDEN_POSN                               0x3
#define _RXM1SIDL_EXIDEN_POSITION                           0x3
#define _RXM1SIDL_EXIDEN_SIZE                               0x1
#define _RXM1SIDL_EXIDEN_LENGTH                             0x1
#define _RXM1SIDL_EXIDEN_MASK                               0x8
#define _RXM1SIDL_SID_POSN                                  0x5
#define _RXM1SIDL_SID_POSITION                              0x5
#define _RXM1SIDL_SID_SIZE                                  0x3
#define _RXM1SIDL_SID_LENGTH                                0x3
#define _RXM1SIDL_SID_MASK                                  0xE0
#define _RXM1SIDL_EID16_POSN                                0x0
#define _RXM1SIDL_EID16_POSITION                            0x0
#define _RXM1SIDL_EID16_SIZE                                0x1
#define _RXM1SIDL_EID16_LENGTH                              0x1
#define _RXM1SIDL_EID16_MASK                                0x1
#define _RXM1SIDL_EID17_POSN                                0x1
#define _RXM1SIDL_EID17_POSITION                            0x1
#define _RXM1SIDL_EID17_SIZE                                0x1
#define _RXM1SIDL_EID17_LENGTH                              0x1
#define _RXM1SIDL_EID17_MASK                                0x2
#define _RXM1SIDL_SID0_POSN                                 0x5
#define _RXM1SIDL_SID0_POSITION                             0x5
#define _RXM1SIDL_SID0_SIZE                                 0x1
#define _RXM1SIDL_SID0_LENGTH                               0x1
#define _RXM1SIDL_SID0_MASK                                 0x20
#define _RXM1SIDL_SID1_POSN                                 0x6
#define _RXM1SIDL_SID1_POSITION                             0x6
#define _RXM1SIDL_SID1_SIZE                                 0x1
#define _RXM1SIDL_SID1_LENGTH                               0x1
#define _RXM1SIDL_SID1_MASK                                 0x40
#define _RXM1SIDL_SID2_POSN                                 0x7
#define _RXM1SIDL_SID2_POSITION                             0x7
#define _RXM1SIDL_SID2_SIZE                                 0x1
#define _RXM1SIDL_SID2_LENGTH                               0x1
#define _RXM1SIDL_SID2_MASK                                 0x80
#define _RXM1SIDL_RXM1EID16_POSN                            0x0
#define _RXM1SIDL_RXM1EID16_POSITION                        0x0
#define _RXM1SIDL_RXM1EID16_SIZE                            0x1
#define _RXM1SIDL_RXM1EID16_LENGTH                          0x1
#define _RXM1SIDL_RXM1EID16_MASK                            0x1
#define _RXM1SIDL_RXM1EID17_POSN                            0x1
#define _RXM1SIDL_RXM1EID17_POSITION                        0x1
#define _RXM1SIDL_RXM1EID17_SIZE                            0x1
#define _RXM1SIDL_RXM1EID17_LENGTH                          0x1
#define _RXM1SIDL_RXM1EID17_MASK                            0x2
#define _RXM1SIDL_RXM1EXIDEN_POSN                           0x3
#define _RXM1SIDL_RXM1EXIDEN_POSITION                       0x3
#define _RXM1SIDL_RXM1EXIDEN_SIZE                           0x1
#define _RXM1SIDL_RXM1EXIDEN_LENGTH                         0x1
#define _RXM1SIDL_RXM1EXIDEN_MASK                           0x8
#define _RXM1SIDL_RXM1SID0_POSN                             0x5
#define _RXM1SIDL_RXM1SID0_POSITION                         0x5
#define _RXM1SIDL_RXM1SID0_SIZE                             0x1
#define _RXM1SIDL_RXM1SID0_LENGTH                           0x1
#define _RXM1SIDL_RXM1SID0_MASK                             0x20
#define _RXM1SIDL_RXM1SID1_POSN                             0x6
#define _RXM1SIDL_RXM1SID1_POSITION                         0x6
#define _RXM1SIDL_RXM1SID1_SIZE                             0x1
#define _RXM1SIDL_RXM1SID1_LENGTH                           0x1
#define _RXM1SIDL_RXM1SID1_MASK                             0x40
#define _RXM1SIDL_RXM1SID2_POSN                             0x7
#define _RXM1SIDL_RXM1SID2_POSITION                         0x7
#define _RXM1SIDL_RXM1SID2_SIZE                             0x1
#define _RXM1SIDL_RXM1SID2_LENGTH                           0x1
#define _RXM1SIDL_RXM1SID2_MASK                             0x80

