MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K80/mcu.h
extern volatile CANCON_RO3bits_t CANCON_RO3bits __at(0xF0F);
// bitfield macros
#define _CANCON_RO3_FP0_POSN                                0x0
#define _CANCON_RO3_FP0_POSITION                            0x0
#define _CANCON_RO3_FP0_SIZE                                0x1
#define _CANCON_RO3_FP0_LENGTH                              0x1
#define _CANCON_RO3_FP0_MASK                                0x1
#define _CANCON_RO3_WIN0_FP1_POSN                           0x1
#define _CANCON_RO3_WIN0_FP1_POSITION                       0x1
#define _CANCON_RO3_WIN0_FP1_SIZE                           0x1
#define _CANCON_RO3_WIN0_FP1_LENGTH                         0x1
#define _CANCON_RO3_WIN0_FP1_MASK                           0x2
#define _CANCON_RO3_WIN1_FP2_POSN                           0x2
#define _CANCON_RO3_WIN1_FP2_POSITION                       0x2
#define _CANCON_RO3_WIN1_FP2_SIZE                           0x1
#define _CANCON_RO3_WIN1_FP2_LENGTH                         0x1
#define _CANCON_RO3_WIN1_FP2_MASK                           0x4
#define _CANCON_RO3_WIN2_FP3_POSN                           0x3
#define _CANCON_RO3_WIN2_FP3_POSITION                       0x3
#define _CANCON_RO3_WIN2_FP3_SIZE                           0x1
#define _CANCON_RO3_WIN2_FP3_LENGTH                         0x1
#define _CANCON_RO3_WIN2_FP3_MASK                           0x8
#define _CANCON_RO3_ABAT_POSN                               0x4
#define _CANCON_RO3_ABAT_POSITION                           0x4
#define _CANCON_RO3_ABAT_SIZE                               0x1
#define _CANCON_RO3_ABAT_LENGTH                             0x1
#define _CANCON_RO3_ABAT_MASK                               0x10
#define _CANCON_RO3_REQOP_POSN                              0x5
#define _CANCON_RO3_REQOP_POSITION                          0x5
#define _CANCON_RO3_REQOP_SIZE                              0x3
#define _CANCON_RO3_REQOP_LENGTH                            0x3
#define _CANCON_RO3_REQOP_MASK                              0xE0
#define _CANCON_RO3_WIN0_POSN                               0x1
#define _CANCON_RO3_WIN0_POSITION                           0x1
#define _CANCON_RO3_WIN0_SIZE                               0x1
#define _CANCON_RO3_WIN0_LENGTH                             0x1
#define _CANCON_RO3_WIN0_MASK                               0x2
#define _CANCON_RO3_WIN1_POSN                               0x2
#define _CANCON_RO3_WIN1_POSITION                           0x2
#define _CANCON_RO3_WIN1_SIZE                               0x1
#define _CANCON_RO3_WIN1_LENGTH                             0x1
#define _CANCON_RO3_WIN1_MASK                               0x4
#define _CANCON_RO3_WIN2_POSN                               0x3
#define _CANCON_RO3_WIN2_POSITION                           0x3
#define _CANCON_RO3_WIN2_SIZE                               0x1
#define _CANCON_RO3_WIN2_LENGTH                             0x1
#define _CANCON_RO3_WIN2_MASK                               0x8
#define _CANCON_RO3_FP1_POSN                                0x1
#define _CANCON_RO3_FP1_POSITION                            0x1
#define _CANCON_RO3_FP1_SIZE                                0x1
#define _CANCON_RO3_FP1_LENGTH                              0x1
#define _CANCON_RO3_FP1_MASK                                0x2
#define _CANCON_RO3_FP2_POSN                                0x2
#define _CANCON_RO3_FP2_POSITION                            0x2
#define _CANCON_RO3_FP2_SIZE                                0x1
#define _CANCON_RO3_FP2_LENGTH                              0x1
#define _CANCON_RO3_FP2_MASK                                0x4
#define _CANCON_RO3_FP3_POSN                                0x3
#define _CANCON_RO3_FP3_POSITION                            0x3
#define _CANCON_RO3_FP3_SIZE                                0x1
#define _CANCON_RO3_FP3_LENGTH                              0x1
#define _CANCON_RO3_FP3_MASK                                0x8

// Register: TXB1CON
#define TXB1CON TXB1CON
extern volatile unsigned char           TXB1CON             __at(0xF10);
#ifndef _LIB_BUILD
asm("TXB1CON equ 0F10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXPRI                  :2;
        unsigned                        :1;
        unsigned TXREQ                  :1;
        unsigned TXERR                  :1;
        unsigned TXLARB                 :1;
        unsigned TXABT                  :1;
        unsigned TXBIF                  :1;
    };
    struct {
        unsigned TXPRI0                 :1;
        unsigned TXPRI1                 :1;
    };
    struct {
        unsigned TXB1PRI0               :1;
        unsigned TXB1PRI1               :1;
        unsigned                        :1;
        unsigned TXB1REQ                :1;
        unsigned TXB1ERR                :1;
        unsigned TXB1LARB               :1;
        unsigned TXB1ABT                :1;
        unsigned TX1IF                  :1;
    };
} TXB1CONbits_t;
extern volatile TXB1CONbits_t TXB1CONbits __at(0xF10);
// bitfield macros
#define _TXB1CON_TXPRI_POSN                                 0x0
#define _TXB1CON_TXPRI_POSITION                             0x0
#define _TXB1CON_TXPRI_SIZE                                 0x2
#define _TXB1CON_TXPRI_LENGTH                               0x2
#define _TXB1CON_TXPRI_MASK                                 0x3
#define _TXB1CON_TXREQ_POSN                                 0x3
#define _TXB1CON_TXREQ_POSITION                             0x3
#define _TXB1CON_TXREQ_SIZE                                 0x1
#define _TXB1CON_TXREQ_LENGTH                               0x1
#define _TXB1CON_TXREQ_MASK                                 0x8
#define _TXB1CON_TXERR_POSN                                 0x4
#define _TXB1CON_TXERR_POSITION                             0x4
#define _TXB1CON_TXERR_SIZE                                 0x1
#define _TXB1CON_TXERR_LENGTH                               0x1
#define _TXB1CON_TXERR_MASK                                 0x10
#define _TXB1CON_TXLARB_POSN                                0x5
#define _TXB1CON_TXLARB_POSITION                            0x5
#define _TXB1CON_TXLARB_SIZE                                0x1
#define _TXB1CON_TXLARB_LENGTH                              0x1
#define _TXB1CON_TXLARB_MASK                                0x20
#define _TXB1CON_TXABT_POSN                                 0x6
#define _TXB1CON_TXABT_POSITION                             0x6
#define _TXB1CON_TXABT_SIZE                                 0x1
#define _TXB1CON_TXABT_LENGTH                               0x1
#define _TXB1CON_TXABT_MASK                                 0x40
#define _TXB1CON_TXBIF_POSN                                 0x7
#define _TXB1CON_TXBIF_POSITION                             0x7
#define _TXB1CON_TXBIF_SIZE                                 0x1
#define _TXB1CON_TXBIF_LENGTH                               0x1
#define _TXB1CON_TXBIF_MASK                                 0x80
#define _TXB1CON_TXPRI0_POSN                                0x0
#define _TXB1CON_TXPRI0_POSITION                            0x0
#define _TXB1CON_TXPRI0_SIZE                                0x1
#define _TXB1CON_TXPRI0_LENGTH                              0x1
#define _TXB1CON_TXPRI0_MASK                                0x1
#define _TXB1CON_TXPRI1_POSN                                0x1
#define _TXB1CON_TXPRI1_POSITION                            0x1
#define _TXB1CON_TXPRI1_SIZE                                0x1
#define _TXB1CON_TXPRI1_LENGTH                              0x1
#define _TXB1CON_TXPRI1_MASK                                0x2
#define _TXB1CON_TXB1PRI0_POSN                              0x0
#define _TXB1CON_TXB1PRI0_POSITION                          0x0
#define _TXB1CON_TXB1PRI0_SIZE                              0x1
#define _TXB1CON_TXB1PRI0_LENGTH                            0x1
#define _TXB1CON_TXB1PRI0_MASK                              0x1
#define _TXB1CON_TXB1PRI1_POSN                              0x1
#define _TXB1CON_TXB1PRI1_POSITION                          0x1
#define _TXB1CON_TXB1PRI1_SIZE                              0x1
#define _TXB1CON_TXB1PRI1_LENGTH                            0x1
#define _TXB1CON_TXB1PRI1_MASK                              0x2
#define _TXB1CON_TXB1REQ_POSN                               0x3
#define _TXB1CON_TXB1REQ_POSITION                           0x3
#define _TXB1CON_TXB1REQ_SIZE                               0x1
#define _TXB1CON_TXB1REQ_LENGTH                             0x1
#define _TXB1CON_TXB1REQ_MASK                               0x8
#define _TXB1CON_TXB1ERR_POSN                               0x4
#define _TXB1CON_TXB1ERR_POSITION                           0x4
#define _TXB1CON_TXB1ERR_SIZE                               0x1
#define _TXB1CON_TXB1ERR_LENGTH                             0x1
#define _TXB1CON_TXB1ERR_MASK                               0x10
#define _TXB1CON_TXB1LARB_POSN                              0x5
#define _TXB1CON_TXB1LARB_POSITION                          0x5
#define _TXB1CON_TXB1LARB_SIZE                              0x1
#define _TXB1CON_TXB1LARB_LENGTH                            0x1
#define _TXB1CON_TXB1LARB_MASK                              0x20
#define _TXB1CON_TXB1ABT_POSN                               0x6
#define _TXB1CON_TXB1ABT_POSITION                           0x6
#define _TXB1CON_TXB1ABT_SIZE                               0x1
#define _TXB1CON_TXB1ABT_LENGTH                             0x1
#define _TXB1CON_TXB1ABT_MASK                               0x40
#define _TXB1CON_TX1IF_POSN                                 0x7
#define _TXB1CON_TX1IF_POSITION                             0x7
#define _TXB1CON_TX1IF_SIZE                                 0x1
#define _TXB1CON_TX1IF_LENGTH                               0x1
#define _TXB1CON_TX1IF_MASK                                 0x80

// Register: TXB1SIDH
#define TXB1SIDH TXB1SIDH
extern volatile unsigned char           TXB1SIDH            __at(0xF11);
#ifndef _LIB_BUILD
asm("TXB1SIDH equ 0F11h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned TXB1SID3               :1;
        unsigned TXB1SID4               :1;
        unsigned TXB1SID5               :1;
        unsigned TXB1SID6               :1;
        unsigned TXB1SID7               :1;
        unsigned TXB1SID8               :1;
        unsigned TXB1SID9               :1;
        unsigned TXB1SID10              :1;
    };
} TXB1SIDHbits_t;
extern volatile TXB1SIDHbits_t TXB1SIDHbits __at(0xF11);
// bitfield macros
#define _TXB1SIDH_SID_POSN                                  0x0
#define _TXB1SIDH_SID_POSITION                              0x0
#define _TXB1SIDH_SID_SIZE                                  0x8
#define _TXB1SIDH_SID_LENGTH                                0x8
#define _TXB1SIDH_SID_MASK                                  0xFF
#define _TXB1SIDH_SID3_POSN                                 0x0
#define _TXB1SIDH_SID3_POSITION                             0x0
#define _TXB1SIDH_SID3_SIZE                                 0x1
#define _TXB1SIDH_SID3_LENGTH                               0x1
#define _TXB1SIDH_SID3_MASK                                 0x1
#define _TXB1SIDH_SID4_POSN                                 0x1
#define _TXB1SIDH_SID4_POSITION                             0x1
#define _TXB1SIDH_SID4_SIZE                                 0x1
#define _TXB1SIDH_SID4_LENGTH                               0x1
#define _TXB1SIDH_SID4_MASK                                 0x2
#define _TXB1SIDH_SID5_POSN                                 0x2
#define _TXB1SIDH_SID5_POSITION                             0x2
#define _TXB1SIDH_SID5_SIZE                                 0x1
#define _TXB1SIDH_SID5_LENGTH                               0x1
#define _TXB1SIDH_SID5_MASK                                 0x4
#define _TXB1SIDH_SID6_POSN                                 0x3
#define _TXB1SIDH_SID6_POSITION                             0x3
#define _TXB1SIDH_SID6_SIZE                                 0x1
#define _TXB1SIDH_SID6_LENGTH                               0x1
#define _TXB1SIDH_SID6_MASK                                 0x8
#define _TXB1SIDH_SID7_POSN                                 0x4
#define _TXB1SIDH_SID7_POSITION                             0x4
#define _TXB1SIDH_SID7_SIZE                                 0x1
#define _TXB1SIDH_SID7_LENGTH                               0x1
#define _TXB1SIDH_SID7_MASK                                 0x10
#define _TXB1SIDH_SID8_POSN                                 0x5
#define _TXB1SIDH_SID8_POSITION                             0x5
#define _TXB1SIDH_SID8_SIZE                                 0x1
#define _TXB1SIDH_SID8_LENGTH                               0x1
#define _TXB1SIDH_SID8_MASK                                 0x20
#define _TXB1SIDH_SID9_POSN                                 0x6
#define _TXB1SIDH_SID9_POSITION                             0x6
#define _TXB1SIDH_SID9_SIZE                                 0x1
#define _TXB1SIDH_SID9_LENGTH                               0x1
#define _TXB1SIDH_SID9_MASK                                 0x40
#define _TXB1SIDH_SID10_POSN                                0x7
#define _TXB1SIDH_SID10_POSITION                            0x7
#define _TXB1SIDH_SID10_SIZE                                0x1
#define _TXB1SIDH_SID10_LENGTH                              0x1
#define _TXB1SIDH_SID10_MASK                                0x80
#define _TXB1SIDH_TXB1SID3_POSN                             0x0
#define _TXB1SIDH_TXB1SID3_POSITION                         0x0
#define _TXB1SIDH_TXB1SID3_SIZE                             0x1
#define _TXB1SIDH_TXB1SID3_LENGTH                           0x1
#define _TXB1SIDH_TXB1SID3_MASK                             0x1
#define _TXB1SIDH_TXB1SID4_POSN                             0x1
#define _TXB1SIDH_TXB1SID4_POSITION                         0x1
#define _TXB1SIDH_TXB1SID4_SIZE                             0x1
#define _TXB1SIDH_TXB1SID4_LENGTH                           0x1
#define _TXB1SIDH_TXB1SID4_MASK                             0x2
#define _TXB1SIDH_TXB1SID5_POSN                             0x2
#define _TXB1SIDH_TXB1SID5_POSITION                         0x2
#define _TXB1SIDH_TXB1SID5_SIZE                             0x1
#define _TXB1SIDH_TXB1SID5_LENGTH                           0x1
#define _TXB1SIDH_TXB1SID5_MASK                             0x4
#define _TXB1SIDH_TXB1SID6_POSN                             0x3
#define _TXB1SIDH_TXB1SID6_POSITION                         0x3
#define _TXB1SIDH_TXB1SID6_SIZE                             0x1
#define _TXB1SIDH_TXB1SID6_LENGTH                           0x1
#define _TXB1SIDH_TXB1SID6_MASK                             0x8
#define _TXB1SIDH_TXB1SID7_POSN                             0x4
#define _TXB1SIDH_TXB1SID7_POSITION                         0x4
#define _TXB1SIDH_TXB1SID7_SIZE                             0x1
#define _TXB1SIDH_TXB1SID7_LENGTH                           0x1
#define _TXB1SIDH_TXB1SID7_MASK                             0x10
#define _TXB1SIDH_TXB1SID8_POSN                             0x5
#define _TXB1SIDH_TXB1SID8_POSITION                         0x5
#define _TXB1SIDH_TXB1SID8_SIZE                             0x1
#define _TXB1SIDH_TXB1SID8_LENGTH                           0x1
#define _TXB1SIDH_TXB1SID8_MASK                             0x20
#define _TXB1SIDH_TXB1SID9_POSN                             0x6
#define _TXB1SIDH_TXB1SID9_POSITION                         0x6
#define _TXB1SIDH_TXB1SID9_SIZE                             0x1
#define _TXB1SIDH_TXB1SID9_LENGTH                           0x1
#define _TXB1SIDH_TXB1SID9_MASK                             0x40
#define _TXB1SIDH_TXB1SID10_POSN                            0x7
#define _TXB1SIDH_TXB1SID10_POSITION                        0x7
#define _TXB1SIDH_TXB1SID10_SIZE                            0x1
#define _TXB1SIDH_TXB1SID10_LENGTH                          0x1
#define _TXB1SIDH_TXB1SID10_MASK                            0x80

