MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K80/mcu.h
extern volatile TXB1D3bits_t TXB1D3bits __at(0xF19);
// bitfield macros
#define _TXB1D3_TXB1D3_POSN                                 0x0
#define _TXB1D3_TXB1D3_POSITION                             0x0
#define _TXB1D3_TXB1D3_SIZE                                 0x8
#define _TXB1D3_TXB1D3_LENGTH                               0x8
#define _TXB1D3_TXB1D3_MASK                                 0xFF
#define _TXB1D3_TXB1D30_POSN                                0x0
#define _TXB1D3_TXB1D30_POSITION                            0x0
#define _TXB1D3_TXB1D30_SIZE                                0x1
#define _TXB1D3_TXB1D30_LENGTH                              0x1
#define _TXB1D3_TXB1D30_MASK                                0x1
#define _TXB1D3_TXB1D31_POSN                                0x1
#define _TXB1D3_TXB1D31_POSITION                            0x1
#define _TXB1D3_TXB1D31_SIZE                                0x1
#define _TXB1D3_TXB1D31_LENGTH                              0x1
#define _TXB1D3_TXB1D31_MASK                                0x2
#define _TXB1D3_TXB1D32_POSN                                0x2
#define _TXB1D3_TXB1D32_POSITION                            0x2
#define _TXB1D3_TXB1D32_SIZE                                0x1
#define _TXB1D3_TXB1D32_LENGTH                              0x1
#define _TXB1D3_TXB1D32_MASK                                0x4
#define _TXB1D3_TXB1D33_POSN                                0x3
#define _TXB1D3_TXB1D33_POSITION                            0x3
#define _TXB1D3_TXB1D33_SIZE                                0x1
#define _TXB1D3_TXB1D33_LENGTH                              0x1
#define _TXB1D3_TXB1D33_MASK                                0x8
#define _TXB1D3_TXB1D34_POSN                                0x4
#define _TXB1D3_TXB1D34_POSITION                            0x4
#define _TXB1D3_TXB1D34_SIZE                                0x1
#define _TXB1D3_TXB1D34_LENGTH                              0x1
#define _TXB1D3_TXB1D34_MASK                                0x10
#define _TXB1D3_TXB1D35_POSN                                0x5
#define _TXB1D3_TXB1D35_POSITION                            0x5
#define _TXB1D3_TXB1D35_SIZE                                0x1
#define _TXB1D3_TXB1D35_LENGTH                              0x1
#define _TXB1D3_TXB1D35_MASK                                0x20
#define _TXB1D3_TXB1D36_POSN                                0x6
#define _TXB1D3_TXB1D36_POSITION                            0x6
#define _TXB1D3_TXB1D36_SIZE                                0x1
#define _TXB1D3_TXB1D36_LENGTH                              0x1
#define _TXB1D3_TXB1D36_MASK                                0x40
#define _TXB1D3_TXB1D37_POSN                                0x7
#define _TXB1D3_TXB1D37_POSITION                            0x7
#define _TXB1D3_TXB1D37_SIZE                                0x1
#define _TXB1D3_TXB1D37_LENGTH                              0x1
#define _TXB1D3_TXB1D37_MASK                                0x80

// Register: TXB1D4
#define TXB1D4 TXB1D4
extern volatile unsigned char           TXB1D4              __at(0xF1A);
#ifndef _LIB_BUILD
asm("TXB1D4 equ 0F1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB1D4                 :8;
    };
    struct {
        unsigned TXB1D40                :1;
        unsigned TXB1D41                :1;
        unsigned TXB1D42                :1;
        unsigned TXB1D43                :1;
        unsigned TXB1D44                :1;
        unsigned TXB1D45                :1;
        unsigned TXB1D46                :1;
        unsigned TXB1D47                :1;
    };
} TXB1D4bits_t;
extern volatile TXB1D4bits_t TXB1D4bits __at(0xF1A);
// bitfield macros
#define _TXB1D4_TXB1D4_POSN                                 0x0
#define _TXB1D4_TXB1D4_POSITION                             0x0
#define _TXB1D4_TXB1D4_SIZE                                 0x8
#define _TXB1D4_TXB1D4_LENGTH                               0x8
#define _TXB1D4_TXB1D4_MASK                                 0xFF
#define _TXB1D4_TXB1D40_POSN                                0x0
#define _TXB1D4_TXB1D40_POSITION                            0x0
#define _TXB1D4_TXB1D40_SIZE                                0x1
#define _TXB1D4_TXB1D40_LENGTH                              0x1
#define _TXB1D4_TXB1D40_MASK                                0x1
#define _TXB1D4_TXB1D41_POSN                                0x1
#define _TXB1D4_TXB1D41_POSITION                            0x1
#define _TXB1D4_TXB1D41_SIZE                                0x1
#define _TXB1D4_TXB1D41_LENGTH                              0x1
#define _TXB1D4_TXB1D41_MASK                                0x2
#define _TXB1D4_TXB1D42_POSN                                0x2
#define _TXB1D4_TXB1D42_POSITION                            0x2
#define _TXB1D4_TXB1D42_SIZE                                0x1
#define _TXB1D4_TXB1D42_LENGTH                              0x1
#define _TXB1D4_TXB1D42_MASK                                0x4
#define _TXB1D4_TXB1D43_POSN                                0x3
#define _TXB1D4_TXB1D43_POSITION                            0x3
#define _TXB1D4_TXB1D43_SIZE                                0x1
#define _TXB1D4_TXB1D43_LENGTH                              0x1
#define _TXB1D4_TXB1D43_MASK                                0x8
#define _TXB1D4_TXB1D44_POSN                                0x4
#define _TXB1D4_TXB1D44_POSITION                            0x4
#define _TXB1D4_TXB1D44_SIZE                                0x1
#define _TXB1D4_TXB1D44_LENGTH                              0x1
#define _TXB1D4_TXB1D44_MASK                                0x10
#define _TXB1D4_TXB1D45_POSN                                0x5
#define _TXB1D4_TXB1D45_POSITION                            0x5
#define _TXB1D4_TXB1D45_SIZE                                0x1
#define _TXB1D4_TXB1D45_LENGTH                              0x1
#define _TXB1D4_TXB1D45_MASK                                0x20
#define _TXB1D4_TXB1D46_POSN                                0x6
#define _TXB1D4_TXB1D46_POSITION                            0x6
#define _TXB1D4_TXB1D46_SIZE                                0x1
#define _TXB1D4_TXB1D46_LENGTH                              0x1
#define _TXB1D4_TXB1D46_MASK                                0x40
#define _TXB1D4_TXB1D47_POSN                                0x7
#define _TXB1D4_TXB1D47_POSITION                            0x7
#define _TXB1D4_TXB1D47_SIZE                                0x1
#define _TXB1D4_TXB1D47_LENGTH                              0x1
#define _TXB1D4_TXB1D47_MASK                                0x80

