MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K80/mcu.h
// Register: ANCON0
#define ANCON0 ANCON0
extern volatile unsigned char           ANCON0              __at(0xF5D);
#ifndef _LIB_BUILD
asm("ANCON0 equ 0F5Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSEL0                 :1;
        unsigned ANSEL1                 :1;
        unsigned ANSEL2                 :1;
        unsigned ANSEL3                 :1;
        unsigned ANSEL4                 :1;
        unsigned ANSEL5                 :1;
        unsigned ANSEL6                 :1;
        unsigned ANSEL7                 :1;
    };
    struct {
        unsigned PCFG0                  :1;
        unsigned PCFG1                  :1;
        unsigned PCFG2                  :1;
        unsigned PCFG3                  :1;
        unsigned PCFG4                  :1;
        unsigned PCFG5                  :1;
        unsigned PCFG6                  :1;
        unsigned PCFG7                  :1;
    };
} ANCON0bits_t;
extern volatile ANCON0bits_t ANCON0bits __at(0xF5D);
// bitfield macros
#define _ANCON0_ANSEL0_POSN                                 0x0
#define _ANCON0_ANSEL0_POSITION                             0x0
#define _ANCON0_ANSEL0_SIZE                                 0x1
#define _ANCON0_ANSEL0_LENGTH                               0x1
#define _ANCON0_ANSEL0_MASK                                 0x1
#define _ANCON0_ANSEL1_POSN                                 0x1
#define _ANCON0_ANSEL1_POSITION                             0x1
#define _ANCON0_ANSEL1_SIZE                                 0x1
#define _ANCON0_ANSEL1_LENGTH                               0x1
#define _ANCON0_ANSEL1_MASK                                 0x2
#define _ANCON0_ANSEL2_POSN                                 0x2
#define _ANCON0_ANSEL2_POSITION                             0x2
#define _ANCON0_ANSEL2_SIZE                                 0x1
#define _ANCON0_ANSEL2_LENGTH                               0x1
#define _ANCON0_ANSEL2_MASK                                 0x4
#define _ANCON0_ANSEL3_POSN                                 0x3
#define _ANCON0_ANSEL3_POSITION                             0x3
#define _ANCON0_ANSEL3_SIZE                                 0x1
#define _ANCON0_ANSEL3_LENGTH                               0x1
#define _ANCON0_ANSEL3_MASK                                 0x8
#define _ANCON0_ANSEL4_POSN                                 0x4
#define _ANCON0_ANSEL4_POSITION                             0x4
#define _ANCON0_ANSEL4_SIZE                                 0x1
#define _ANCON0_ANSEL4_LENGTH                               0x1
#define _ANCON0_ANSEL4_MASK                                 0x10
#define _ANCON0_ANSEL5_POSN                                 0x5
#define _ANCON0_ANSEL5_POSITION                             0x5
#define _ANCON0_ANSEL5_SIZE                                 0x1
#define _ANCON0_ANSEL5_LENGTH                               0x1
#define _ANCON0_ANSEL5_MASK                                 0x20
#define _ANCON0_ANSEL6_POSN                                 0x6
#define _ANCON0_ANSEL6_POSITION                             0x6
#define _ANCON0_ANSEL6_SIZE                                 0x1
#define _ANCON0_ANSEL6_LENGTH                               0x1
#define _ANCON0_ANSEL6_MASK                                 0x40
#define _ANCON0_ANSEL7_POSN                                 0x7
#define _ANCON0_ANSEL7_POSITION                             0x7
#define _ANCON0_ANSEL7_SIZE                                 0x1
#define _ANCON0_ANSEL7_LENGTH                               0x1
#define _ANCON0_ANSEL7_MASK                                 0x80
#define _ANCON0_PCFG0_POSN                                  0x0
#define _ANCON0_PCFG0_POSITION                              0x0
#define _ANCON0_PCFG0_SIZE                                  0x1
#define _ANCON0_PCFG0_LENGTH                                0x1
#define _ANCON0_PCFG0_MASK                                  0x1
#define _ANCON0_PCFG1_POSN                                  0x1
#define _ANCON0_PCFG1_POSITION                              0x1
#define _ANCON0_PCFG1_SIZE                                  0x1
#define _ANCON0_PCFG1_LENGTH                                0x1
#define _ANCON0_PCFG1_MASK                                  0x2
#define _ANCON0_PCFG2_POSN                                  0x2
#define _ANCON0_PCFG2_POSITION                              0x2
#define _ANCON0_PCFG2_SIZE                                  0x1
#define _ANCON0_PCFG2_LENGTH                                0x1
#define _ANCON0_PCFG2_MASK                                  0x4
#define _ANCON0_PCFG3_POSN                                  0x3
#define _ANCON0_PCFG3_POSITION                              0x3
#define _ANCON0_PCFG3_SIZE                                  0x1
#define _ANCON0_PCFG3_LENGTH                                0x1
#define _ANCON0_PCFG3_MASK                                  0x8
#define _ANCON0_PCFG4_POSN                                  0x4
#define _ANCON0_PCFG4_POSITION                              0x4
#define _ANCON0_PCFG4_SIZE                                  0x1
#define _ANCON0_PCFG4_LENGTH                                0x1
#define _ANCON0_PCFG4_MASK                                  0x10
#define _ANCON0_PCFG5_POSN                                  0x5
#define _ANCON0_PCFG5_POSITION                              0x5
#define _ANCON0_PCFG5_SIZE                                  0x1
#define _ANCON0_PCFG5_LENGTH                                0x1
#define _ANCON0_PCFG5_MASK                                  0x20
#define _ANCON0_PCFG6_POSN                                  0x6
#define _ANCON0_PCFG6_POSITION                              0x6
#define _ANCON0_PCFG6_SIZE                                  0x1
#define _ANCON0_PCFG6_LENGTH                                0x1
#define _ANCON0_PCFG6_MASK                                  0x40
#define _ANCON0_PCFG7_POSN                                  0x7
#define _ANCON0_PCFG7_POSITION                              0x7
#define _ANCON0_PCFG7_SIZE                                  0x1
#define _ANCON0_PCFG7_LENGTH                                0x1
#define _ANCON0_PCFG7_MASK                                  0x80

