MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K80/mcu.h
extern volatile EEDATAbits_t EEDATAbits __at(0xF73);
// bitfield macros
#define _EEDATA_EEDATA_POSN                                 0x0
#define _EEDATA_EEDATA_POSITION                             0x0
#define _EEDATA_EEDATA_SIZE                                 0x8
#define _EEDATA_EEDATA_LENGTH                               0x8
#define _EEDATA_EEDATA_MASK                                 0xFF

// Register: EEADR
#define EEADR EEADR
extern volatile unsigned char           EEADR               __at(0xF74);
#ifndef _LIB_BUILD
asm("EEADR equ 0F74h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEADR                  :8;
    };
} EEADRbits_t;
extern volatile EEADRbits_t EEADRbits __at(0xF74);
// bitfield macros
#define _EEADR_EEADR_POSN                                   0x0
#define _EEADR_EEADR_POSITION                               0x0
#define _EEADR_EEADR_SIZE                                   0x8
#define _EEADR_EEADR_LENGTH                                 0x8
#define _EEADR_EEADR_MASK                                   0xFF

// Register: EEADRH
#define EEADRH EEADRH
extern volatile unsigned char           EEADRH              __at(0xF75);
#ifndef _LIB_BUILD
asm("EEADRH equ 0F75h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEADRH                 :8;
    };
} EEADRHbits_t;
extern volatile EEADRHbits_t EEADRHbits __at(0xF75);
// bitfield macros
#define _EEADRH_EEADRH_POSN                                 0x0
#define _EEADRH_EEADRH_POSITION                             0x0
#define _EEADRH_EEADRH_SIZE                                 0x8
#define _EEADRH_EEADRH_LENGTH                               0x8
#define _EEADRH_EEADRH_MASK                                 0xFF

// Register: PIE5
#define PIE5 PIE5
extern volatile unsigned char           PIE5                __at(0xF76);
#ifndef _LIB_BUILD
asm("PIE5 equ 0F76h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0IE                 :1;
        unsigned RXB1IE                 :1;
        unsigned TXB0IE                 :1;
        unsigned TXB1IE                 :1;
        unsigned TXB2IE                 :1;
        unsigned ERRIE                  :1;
        unsigned WAKIE                  :1;
        unsigned IRXIE                  :1;
    };
    struct {
        unsigned FIFOWMIE               :1;
        unsigned RXBnIE                 :1;
        unsigned                        :2;
        unsigned TXBnIE                 :1;
    };
} PIE5bits_t;
extern volatile PIE5bits_t PIE5bits __at(0xF76);
// bitfield macros
#define _PIE5_RXB0IE_POSN                                   0x0
#define _PIE5_RXB0IE_POSITION                               0x0
#define _PIE5_RXB0IE_SIZE                                   0x1
#define _PIE5_RXB0IE_LENGTH                                 0x1
#define _PIE5_RXB0IE_MASK                                   0x1
#define _PIE5_RXB1IE_POSN                                   0x1
#define _PIE5_RXB1IE_POSITION                               0x1
#define _PIE5_RXB1IE_SIZE                                   0x1
#define _PIE5_RXB1IE_LENGTH                                 0x1
#define _PIE5_RXB1IE_MASK                                   0x2
#define _PIE5_TXB0IE_POSN                                   0x2
#define _PIE5_TXB0IE_POSITION                               0x2
#define _PIE5_TXB0IE_SIZE                                   0x1
#define _PIE5_TXB0IE_LENGTH                                 0x1
#define _PIE5_TXB0IE_MASK                                   0x4
#define _PIE5_TXB1IE_POSN                                   0x3
#define _PIE5_TXB1IE_POSITION                               0x3
#define _PIE5_TXB1IE_SIZE                                   0x1
#define _PIE5_TXB1IE_LENGTH                                 0x1
#define _PIE5_TXB1IE_MASK                                   0x8
#define _PIE5_TXB2IE_POSN                                   0x4
#define _PIE5_TXB2IE_POSITION                               0x4
#define _PIE5_TXB2IE_SIZE                                   0x1
#define _PIE5_TXB2IE_LENGTH                                 0x1
#define _PIE5_TXB2IE_MASK                                   0x10
#define _PIE5_ERRIE_POSN                                    0x5
#define _PIE5_ERRIE_POSITION                                0x5
#define _PIE5_ERRIE_SIZE                                    0x1
#define _PIE5_ERRIE_LENGTH                                  0x1
#define _PIE5_ERRIE_MASK                                    0x20
#define _PIE5_WAKIE_POSN                                    0x6
#define _PIE5_WAKIE_POSITION                                0x6
#define _PIE5_WAKIE_SIZE                                    0x1
#define _PIE5_WAKIE_LENGTH                                  0x1
#define _PIE5_WAKIE_MASK                                    0x40
#define _PIE5_IRXIE_POSN                                    0x7
#define _PIE5_IRXIE_POSITION                                0x7
#define _PIE5_IRXIE_SIZE                                    0x1
#define _PIE5_IRXIE_LENGTH                                  0x1
#define _PIE5_IRXIE_MASK                                    0x80
#define _PIE5_FIFOWMIE_POSN                                 0x0
#define _PIE5_FIFOWMIE_POSITION                             0x0
#define _PIE5_FIFOWMIE_SIZE                                 0x1
#define _PIE5_FIFOWMIE_LENGTH                               0x1
#define _PIE5_FIFOWMIE_MASK                                 0x1
#define _PIE5_RXBnIE_POSN                                   0x1
#define _PIE5_RXBnIE_POSITION                               0x1
#define _PIE5_RXBnIE_SIZE                                   0x1
#define _PIE5_RXBnIE_LENGTH                                 0x1
#define _PIE5_RXBnIE_MASK                                   0x2
#define _PIE5_TXBnIE_POSN                                   0x4
#define _PIE5_TXBnIE_POSITION                               0x4
#define _PIE5_TXBnIE_SIZE                                   0x1
#define _PIE5_TXBnIE_LENGTH                                 0x1
#define _PIE5_TXBnIE_MASK                                   0x10

