MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K80/mcu.h
// Register: SLRCON
#define SLRCON SLRCON
extern volatile unsigned char           SLRCON              __at(0xF90);
#ifndef _LIB_BUILD
asm("SLRCON equ 0F90h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRA                   :1;
        unsigned SLRB                   :1;
        unsigned SLRC                   :1;
        unsigned SLRD                   :1;
        unsigned SLRE                   :1;
    };
} SLRCONbits_t;
extern volatile SLRCONbits_t SLRCONbits __at(0xF90);
// bitfield macros
#define _SLRCON_SLRA_POSN                                   0x0
#define _SLRCON_SLRA_POSITION                               0x0
#define _SLRCON_SLRA_SIZE                                   0x1
#define _SLRCON_SLRA_LENGTH                                 0x1
#define _SLRCON_SLRA_MASK                                   0x1
#define _SLRCON_SLRB_POSN                                   0x1
#define _SLRCON_SLRB_POSITION                               0x1
#define _SLRCON_SLRB_SIZE                                   0x1
#define _SLRCON_SLRB_LENGTH                                 0x1
#define _SLRCON_SLRB_MASK                                   0x2
#define _SLRCON_SLRC_POSN                                   0x2
#define _SLRCON_SLRC_POSITION                               0x2
#define _SLRCON_SLRC_SIZE                                   0x1
#define _SLRCON_SLRC_LENGTH                                 0x1
#define _SLRCON_SLRC_MASK                                   0x4
#define _SLRCON_SLRD_POSN                                   0x3
#define _SLRCON_SLRD_POSITION                               0x3
#define _SLRCON_SLRD_SIZE                                   0x1
#define _SLRCON_SLRD_LENGTH                                 0x1
#define _SLRCON_SLRD_MASK                                   0x8
#define _SLRCON_SLRE_POSN                                   0x4
#define _SLRCON_SLRE_POSITION                               0x4
#define _SLRCON_SLRE_SIZE                                   0x1
#define _SLRCON_SLRE_LENGTH                                 0x1
#define _SLRCON_SLRE_MASK                                   0x10

// Register: ODCON
#define ODCON ODCON
extern volatile unsigned char           ODCON               __at(0xF91);
#ifndef _LIB_BUILD
asm("ODCON equ 0F91h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1OD                   :1;
        unsigned U2OD                   :1;
        unsigned CCP1OD                 :1;
        unsigned CCP2OD                 :1;
        unsigned CCP3OD                 :1;
        unsigned CCP4OD                 :1;
        unsigned CCP5OD                 :1;
        unsigned SSPOD                  :1;
    };
} ODCONbits_t;
extern volatile ODCONbits_t ODCONbits __at(0xF91);
// bitfield macros
#define _ODCON_U1OD_POSN                                    0x0
#define _ODCON_U1OD_POSITION                                0x0
#define _ODCON_U1OD_SIZE                                    0x1
#define _ODCON_U1OD_LENGTH                                  0x1
#define _ODCON_U1OD_MASK                                    0x1
#define _ODCON_U2OD_POSN                                    0x1
#define _ODCON_U2OD_POSITION                                0x1
#define _ODCON_U2OD_SIZE                                    0x1
#define _ODCON_U2OD_LENGTH                                  0x1
#define _ODCON_U2OD_MASK                                    0x2
#define _ODCON_CCP1OD_POSN                                  0x2
#define _ODCON_CCP1OD_POSITION                              0x2
#define _ODCON_CCP1OD_SIZE                                  0x1
#define _ODCON_CCP1OD_LENGTH                                0x1
#define _ODCON_CCP1OD_MASK                                  0x4
#define _ODCON_CCP2OD_POSN                                  0x3
#define _ODCON_CCP2OD_POSITION                              0x3
#define _ODCON_CCP2OD_SIZE                                  0x1
#define _ODCON_CCP2OD_LENGTH                                0x1
#define _ODCON_CCP2OD_MASK                                  0x8
#define _ODCON_CCP3OD_POSN                                  0x4
#define _ODCON_CCP3OD_POSITION                              0x4
#define _ODCON_CCP3OD_SIZE                                  0x1
#define _ODCON_CCP3OD_LENGTH                                0x1
#define _ODCON_CCP3OD_MASK                                  0x10
#define _ODCON_CCP4OD_POSN                                  0x5
#define _ODCON_CCP4OD_POSITION                              0x5
#define _ODCON_CCP4OD_SIZE                                  0x1
#define _ODCON_CCP4OD_LENGTH                                0x1
#define _ODCON_CCP4OD_MASK                                  0x20
#define _ODCON_CCP5OD_POSN                                  0x6
#define _ODCON_CCP5OD_POSITION                              0x6
#define _ODCON_CCP5OD_SIZE                                  0x1
#define _ODCON_CCP5OD_LENGTH                                0x1
#define _ODCON_CCP5OD_MASK                                  0x40
#define _ODCON_SSPOD_POSN                                   0x7
#define _ODCON_SSPOD_POSITION                               0x7
#define _ODCON_SSPOD_SIZE                                   0x1
#define _ODCON_SSPOD_LENGTH                                 0x1
#define _ODCON_SSPOD_MASK                                   0x80

// Register: TRISA
#define TRISA TRISA
extern volatile unsigned char           TRISA               __at(0xF92);
#ifndef _LIB_BUILD
asm("TRISA equ 0F92h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISA0                 :1;
        unsigned TRISA1                 :1;
        unsigned TRISA2                 :1;
        unsigned TRISA3                 :1;
        unsigned                        :1;
        unsigned TRISA5                 :1;
        unsigned TRISA6                 :1;
        unsigned TRISA7                 :1;
    };
} TRISAbits_t;
extern volatile TRISAbits_t TRISAbits __at(0xF92);
// bitfield macros
#define _TRISA_TRISA0_POSN                                  0x0
#define _TRISA_TRISA0_POSITION                              0x0
#define _TRISA_TRISA0_SIZE                                  0x1
#define _TRISA_TRISA0_LENGTH                                0x1
#define _TRISA_TRISA0_MASK                                  0x1
#define _TRISA_TRISA1_POSN                                  0x1
#define _TRISA_TRISA1_POSITION                              0x1
#define _TRISA_TRISA1_SIZE                                  0x1
#define _TRISA_TRISA1_LENGTH                                0x1
#define _TRISA_TRISA1_MASK                                  0x2
#define _TRISA_TRISA2_POSN                                  0x2
#define _TRISA_TRISA2_POSITION                              0x2
#define _TRISA_TRISA2_SIZE                                  0x1
#define _TRISA_TRISA2_LENGTH                                0x1
#define _TRISA_TRISA2_MASK                                  0x4
#define _TRISA_TRISA3_POSN                                  0x3
#define _TRISA_TRISA3_POSITION                              0x3
#define _TRISA_TRISA3_SIZE                                  0x1
#define _TRISA_TRISA3_LENGTH                                0x1
#define _TRISA_TRISA3_MASK                                  0x8
#define _TRISA_TRISA5_POSN                                  0x5
#define _TRISA_TRISA5_POSITION                              0x5
#define _TRISA_TRISA5_SIZE                                  0x1
#define _TRISA_TRISA5_LENGTH                                0x1
#define _TRISA_TRISA5_MASK                                  0x20
#define _TRISA_TRISA6_POSN                                  0x6
#define _TRISA_TRISA6_POSITION                              0x6
#define _TRISA_TRISA6_SIZE                                  0x1
#define _TRISA_TRISA6_LENGTH                                0x1
#define _TRISA_TRISA6_MASK                                  0x40
#define _TRISA_TRISA7_POSN                                  0x7
#define _TRISA_TRISA7_POSITION                              0x7
#define _TRISA_TRISA7_SIZE                                  0x1
#define _TRISA_TRISA7_LENGTH                                0x1
#define _TRISA_TRISA7_MASK                                  0x80

// Register: TRISB
#define TRISB TRISB
extern volatile unsigned char           TRISB               __at(0xF93);
#ifndef _LIB_BUILD
asm("TRISB equ 0F93h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISB0                 :1;
        unsigned TRISB1                 :1;
        unsigned TRISB2                 :1;
        unsigned TRISB3                 :1;
        unsigned TRISB4                 :1;
        unsigned TRISB5                 :1;
        unsigned TRISB6                 :1;
        unsigned TRISB7                 :1;
    };
} TRISBbits_t;
