MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K80/mcu.h
#define                                 RXB1D61_bit         _BIT_ACCESS(RXB1D6,1)
// RXB1D6<RXB1D62>
extern volatile __bit                   RXB1D62             __at(0x79E2);	// @ (0xF3C * 8 + 2)
#define                                 RXB1D62_bit         _BIT_ACCESS(RXB1D6,2)
// RXB1D6<RXB1D63>
extern volatile __bit                   RXB1D63             __at(0x79E3);	// @ (0xF3C * 8 + 3)
#define                                 RXB1D63_bit         _BIT_ACCESS(RXB1D6,3)
// RXB1D6<RXB1D64>
extern volatile __bit                   RXB1D64             __at(0x79E4);	// @ (0xF3C * 8 + 4)
#define                                 RXB1D64_bit         _BIT_ACCESS(RXB1D6,4)
// RXB1D6<RXB1D65>
extern volatile __bit                   RXB1D65             __at(0x79E5);	// @ (0xF3C * 8 + 5)
#define                                 RXB1D65_bit         _BIT_ACCESS(RXB1D6,5)
// RXB1D6<RXB1D66>
extern volatile __bit                   RXB1D66             __at(0x79E6);	// @ (0xF3C * 8 + 6)
#define                                 RXB1D66_bit         _BIT_ACCESS(RXB1D6,6)
// RXB1D6<RXB1D67>
extern volatile __bit                   RXB1D67             __at(0x79E7);	// @ (0xF3C * 8 + 7)
#define                                 RXB1D67_bit         _BIT_ACCESS(RXB1D6,7)
// RXB1D7<RXB1D70>
extern volatile __bit                   RXB1D70             __at(0x79E8);	// @ (0xF3D * 8 + 0)
#define                                 RXB1D70_bit         _BIT_ACCESS(RXB1D7,0)
// RXB1D7<RXB1D71>
extern volatile __bit                   RXB1D71             __at(0x79E9);	// @ (0xF3D * 8 + 1)
#define                                 RXB1D71_bit         _BIT_ACCESS(RXB1D7,1)
// RXB1D7<RXB1D72>
extern volatile __bit                   RXB1D72             __at(0x79EA);	// @ (0xF3D * 8 + 2)
#define                                 RXB1D72_bit         _BIT_ACCESS(RXB1D7,2)
// RXB1D7<RXB1D73>
extern volatile __bit                   RXB1D73             __at(0x79EB);	// @ (0xF3D * 8 + 3)
#define                                 RXB1D73_bit         _BIT_ACCESS(RXB1D7,3)
// RXB1D7<RXB1D74>
extern volatile __bit                   RXB1D74             __at(0x79EC);	// @ (0xF3D * 8 + 4)
#define                                 RXB1D74_bit         _BIT_ACCESS(RXB1D7,4)
// RXB1D7<RXB1D75>
extern volatile __bit                   RXB1D75             __at(0x79ED);	// @ (0xF3D * 8 + 5)
#define                                 RXB1D75_bit         _BIT_ACCESS(RXB1D7,5)
// RXB1D7<RXB1D76>
extern volatile __bit                   RXB1D76             __at(0x79EE);	// @ (0xF3D * 8 + 6)
#define                                 RXB1D76_bit         _BIT_ACCESS(RXB1D7,6)
// RXB1D7<RXB1D77>
extern volatile __bit                   RXB1D77             __at(0x79EF);	// @ (0xF3D * 8 + 7)
#define                                 RXB1D77_bit         _BIT_ACCESS(RXB1D7,7)
// RXB1DLC<RXB1DLC0>
extern volatile __bit                   RXB1DLC0            __at(0x79A8);	// @ (0xF35 * 8 + 0)
#define                                 RXB1DLC0_bit        _BIT_ACCESS(RXB1DLC,0)
// RXB1DLC<RXB1DLC1>
extern volatile __bit                   RXB1DLC1            __at(0x79A9);	// @ (0xF35 * 8 + 1)
#define                                 RXB1DLC1_bit        _BIT_ACCESS(RXB1DLC,1)
// RXB1DLC<RXB1DLC2>
extern volatile __bit                   RXB1DLC2            __at(0x79AA);	// @ (0xF35 * 8 + 2)
#define                                 RXB1DLC2_bit        _BIT_ACCESS(RXB1DLC,2)
// RXB1DLC<RXB1DLC3>
extern volatile __bit                   RXB1DLC3            __at(0x79AB);	// @ (0xF35 * 8 + 3)
#define                                 RXB1DLC3_bit        _BIT_ACCESS(RXB1DLC,3)
// RXB1EIDL<RXB1EID0>
extern volatile __bit                   RXB1EID0            __at(0x79A0);	// @ (0xF34 * 8 + 0)
#define                                 RXB1EID0_bit        _BIT_ACCESS(RXB1EIDL,0)
// RXB1EIDL<RXB1EID1>
extern volatile __bit                   RXB1EID1            __at(0x79A1);	// @ (0xF34 * 8 + 1)
#define                                 RXB1EID1_bit        _BIT_ACCESS(RXB1EIDL,1)
// RXB1EIDH<RXB1EID10>
extern volatile __bit                   RXB1EID10           __at(0x799A);	// @ (0xF33 * 8 + 2)
#define                                 RXB1EID10_bit       _BIT_ACCESS(RXB1EIDH,2)
// RXB1EIDH<RXB1EID11>
extern volatile __bit                   RXB1EID11           __at(0x799B);	// @ (0xF33 * 8 + 3)
#define                                 RXB1EID11_bit       _BIT_ACCESS(RXB1EIDH,3)
// RXB1EIDH<RXB1EID12>
extern volatile __bit                   RXB1EID12           __at(0x799C);	// @ (0xF33 * 8 + 4)
#define                                 RXB1EID12_bit       _BIT_ACCESS(RXB1EIDH,4)
// RXB1EIDH<RXB1EID13>
extern volatile __bit                   RXB1EID13           __at(0x799D);	// @ (0xF33 * 8 + 5)
#define                                 RXB1EID13_bit       _BIT_ACCESS(RXB1EIDH,5)
// RXB1EIDH<RXB1EID14>
extern volatile __bit                   RXB1EID14           __at(0x799E);	// @ (0xF33 * 8 + 6)
#define                                 RXB1EID14_bit       _BIT_ACCESS(RXB1EIDH,6)
// RXB1EIDH<RXB1EID15>
extern volatile __bit                   RXB1EID15           __at(0x799F);	// @ (0xF33 * 8 + 7)
#define                                 RXB1EID15_bit       _BIT_ACCESS(RXB1EIDH,7)
// RXB1SIDL<RXB1EID16>
extern volatile __bit                   RXB1EID16           __at(0x7990);	// @ (0xF32 * 8 + 0)
#define                                 RXB1EID16_bit       _BIT_ACCESS(RXB1SIDL,0)
// RXB1SIDL<RXB1EID17>
extern volatile __bit                   RXB1EID17           __at(0x7991);	// @ (0xF32 * 8 + 1)
#define                                 RXB1EID17_bit       _BIT_ACCESS(RXB1SIDL,1)
// RXB1EIDL<RXB1EID2>
extern volatile __bit                   RXB1EID2            __at(0x79A2);	// @ (0xF34 * 8 + 2)
#define                                 RXB1EID2_bit        _BIT_ACCESS(RXB1EIDL,2)
// RXB1EIDL<RXB1EID3>
extern volatile __bit                   RXB1EID3            __at(0x79A3);	// @ (0xF34 * 8 + 3)
#define                                 RXB1EID3_bit        _BIT_ACCESS(RXB1EIDL,3)
// RXB1EIDL<RXB1EID4>
extern volatile __bit                   RXB1EID4            __at(0x79A4);	// @ (0xF34 * 8 + 4)
#define                                 RXB1EID4_bit        _BIT_ACCESS(RXB1EIDL,4)
// RXB1EIDL<RXB1EID5>
extern volatile __bit                   RXB1EID5            __at(0x79A5);	// @ (0xF34 * 8 + 5)
#define                                 RXB1EID5_bit        _BIT_ACCESS(RXB1EIDL,5)
// RXB1EIDL<RXB1EID6>
extern volatile __bit                   RXB1EID6            __at(0x79A6);	// @ (0xF34 * 8 + 6)
#define                                 RXB1EID6_bit        _BIT_ACCESS(RXB1EIDL,6)
// RXB1EIDL<RXB1EID7>
extern volatile __bit                   RXB1EID7            __at(0x79A7);	// @ (0xF34 * 8 + 7)
#define                                 RXB1EID7_bit        _BIT_ACCESS(RXB1EIDL,7)
// RXB1EIDH<RXB1EID8>
extern volatile __bit                   RXB1EID8            __at(0x7998);	// @ (0xF33 * 8 + 0)
#define                                 RXB1EID8_bit        _BIT_ACCESS(RXB1EIDH,0)
// RXB1EIDH<RXB1EID9>
extern volatile __bit                   RXB1EID9            __at(0x7999);	// @ (0xF33 * 8 + 1)
#define                                 RXB1EID9_bit        _BIT_ACCESS(RXB1EIDH,1)
// RXB1SIDL<RXB1EXID>
extern volatile __bit                   RXB1EXID            __at(0x7993);	// @ (0xF32 * 8 + 3)
#define                                 RXB1EXID_bit        _BIT_ACCESS(RXB1SIDL,3)
// RXB1CON<RXB1FILHIT0>
extern volatile __bit                   RXB1FILHIT0         __at(0x7980);	// @ (0xF30 * 8 + 0)
#define                                 RXB1FILHIT0_bit     _BIT_ACCESS(RXB1CON,0)
// RXB1CON<RXB1FILHIT1>
extern volatile __bit                   RXB1FILHIT1         __at(0x7981);	// @ (0xF30 * 8 + 1)
#define                                 RXB1FILHIT1_bit     _BIT_ACCESS(RXB1CON,1)
// RXB1CON<RXB1FILHIT2>
extern volatile __bit                   RXB1FILHIT2         __at(0x7982);	// @ (0xF30 * 8 + 2)
#define                                 RXB1FILHIT2_bit     _BIT_ACCESS(RXB1CON,2)
// RXB1CON<RXB1FILHIT3>
extern volatile __bit                   RXB1FILHIT3         __at(0x7983);	// @ (0xF30 * 8 + 3)
#define                                 RXB1FILHIT3_bit     _BIT_ACCESS(RXB1CON,3)
// RXB1CON<RXB1FILHIT4>
extern volatile __bit                   RXB1FILHIT4         __at(0x7984);	// @ (0xF30 * 8 + 4)
#define                                 RXB1FILHIT4_bit     _BIT_ACCESS(RXB1CON,4)
// RXB1CON<RXB1FUL>
extern volatile __bit                   RXB1FUL             __at(0x7987);	// @ (0xF30 * 8 + 7)
#define                                 RXB1FUL_bit         _BIT_ACCESS(RXB1CON,7)
// PIR5<RXB1IF>
extern volatile __bit                   RXB1IF              __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 RXB1IF_bit          _BIT_ACCESS(PIR5,1)
// IPR5<RXB1IP>
extern volatile __bit                   RXB1IP              __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 RXB1IP_bit          _BIT_ACCESS(IPR5,1)
// RXB1CON<RXB1M0>
extern volatile __bit                   RXB1M0              __at(0x7985);	// @ (0xF30 * 8 + 5)
#define                                 RXB1M0_bit          _BIT_ACCESS(RXB1CON,5)
// RXB1CON<RXB1M1>
extern volatile __bit                   RXB1M1              __at(0x7986);	// @ (0xF30 * 8 + 6)
#define                                 RXB1M1_bit          _BIT_ACCESS(RXB1CON,6)
// COMSTAT<RXB1OVFL>
extern volatile __bit                   RXB1OVFL            __at(0x7B8E);	// @ (0xF71 * 8 + 6)
#define                                 RXB1OVFL_bit        _BIT_ACCESS(COMSTAT,6)
// RXB1DLC<RXB1RB0>
extern volatile __bit                   RXB1RB0             __at(0x79AC);	// @ (0xF35 * 8 + 4)
#define                                 RXB1RB0_bit         _BIT_ACCESS(RXB1DLC,4)
// RXB1DLC<RXB1RB1>
extern volatile __bit                   RXB1RB1             __at(0x79AD);	// @ (0xF35 * 8 + 5)
#define                                 RXB1RB1_bit         _BIT_ACCESS(RXB1DLC,5)
// RXB1DLC<RXB1RTR>
extern volatile __bit                   RXB1RTR             __at(0x79AE);	// @ (0xF35 * 8 + 6)
#define                                 RXB1RTR_bit         _BIT_ACCESS(RXB1DLC,6)
// RXB1CON<RXB1RTRR0>
extern volatile __bit                   RXB1RTRR0           __at(0x7983);	// @ (0xF30 * 8 + 3)
#define                                 RXB1RTRR0_bit       _BIT_ACCESS(RXB1CON,3)
// RXB1CON<RXB1RTRRO>
extern volatile __bit                   RXB1RTRRO           __at(0x7985);	// @ (0xF30 * 8 + 5)
#define                                 RXB1RTRRO_bit       _BIT_ACCESS(RXB1CON,5)
// RXB1SIDL<RXB1SID0>
extern volatile __bit                   RXB1SID0            __at(0x7995);	// @ (0xF32 * 8 + 5)
#define                                 RXB1SID0_bit        _BIT_ACCESS(RXB1SIDL,5)
// RXB1SIDL<RXB1SID1>
extern volatile __bit                   RXB1SID1            __at(0x7996);	// @ (0xF32 * 8 + 6)
#define                                 RXB1SID1_bit        _BIT_ACCESS(RXB1SIDL,6)
// RXB1SIDH<RXB1SID10>
extern volatile __bit                   RXB1SID10           __at(0x798F);	// @ (0xF31 * 8 + 7)
#define                                 RXB1SID10_bit       _BIT_ACCESS(RXB1SIDH,7)
// RXB1SIDL<RXB1SID2>
extern volatile __bit                   RXB1SID2            __at(0x7997);	// @ (0xF32 * 8 + 7)
#define                                 RXB1SID2_bit        _BIT_ACCESS(RXB1SIDL,7)
// RXB1SIDH<RXB1SID3>
extern volatile __bit                   RXB1SID3            __at(0x7988);	// @ (0xF31 * 8 + 0)
#define                                 RXB1SID3_bit        _BIT_ACCESS(RXB1SIDH,0)
// RXB1SIDH<RXB1SID4>
extern volatile __bit                   RXB1SID4            __at(0x7989);	// @ (0xF31 * 8 + 1)
#define                                 RXB1SID4_bit        _BIT_ACCESS(RXB1SIDH,1)
// RXB1SIDH<RXB1SID5>
extern volatile __bit                   RXB1SID5            __at(0x798A);	// @ (0xF31 * 8 + 2)
#define                                 RXB1SID5_bit        _BIT_ACCESS(RXB1SIDH,2)
// RXB1SIDH<RXB1SID6>
extern volatile __bit                   RXB1SID6            __at(0x798B);	// @ (0xF31 * 8 + 3)
#define                                 RXB1SID6_bit        _BIT_ACCESS(RXB1SIDH,3)
// RXB1SIDH<RXB1SID7>
extern volatile __bit                   RXB1SID7            __at(0x798C);	// @ (0xF31 * 8 + 4)
#define                                 RXB1SID7_bit        _BIT_ACCESS(RXB1SIDH,4)
// RXB1SIDH<RXB1SID8>
extern volatile __bit                   RXB1SID8            __at(0x798D);	// @ (0xF31 * 8 + 5)
#define                                 RXB1SID8_bit        _BIT_ACCESS(RXB1SIDH,5)
// RXB1SIDH<RXB1SID9>
extern volatile __bit                   RXB1SID9            __at(0x798E);	// @ (0xF31 * 8 + 6)
#define                                 RXB1SID9_bit        _BIT_ACCESS(RXB1SIDH,6)
// RXB1SIDL<RXB1SRR>
extern volatile __bit                   RXB1SRR             __at(0x7994);	// @ (0xF32 * 8 + 4)
#define                                 RXB1SRR_bit         _BIT_ACCESS(RXB1SIDL,4)
// PIE3<RXBNIE>
extern volatile __bit                   RXBNIE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXBNIE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<RXBNIF>
extern volatile __bit                   RXBNIF              __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 RXBNIF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<RXBNIP>
extern volatile __bit                   RXBNIP              __at(0x7D29);	// @ (0xFA5 * 8 + 1)
#define                                 RXBNIP_bit          _BIT_ACCESS(IPR3,1)
// COMSTAT<RXBNOVFL>
extern volatile __bit                   RXBNOVFL            __at(0x7B8E);	// @ (0xF71 * 8 + 6)
#define                                 RXBNOVFL_bit        _BIT_ACCESS(COMSTAT,6)
// COMSTAT<RXBP>
extern volatile __bit                   RXBP                __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 RXBP_bit            _BIT_ACCESS(COMSTAT,3)
// PIE5<RXBnIE>
extern volatile __bit                   RXBnIE              __at(0x7BB1);	// @ (0xF76 * 8 + 1)
#define                                 RXBnIE_bit          _BIT_ACCESS(PIE5,1)
// PIR5<RXBnIF>
extern volatile __bit                   RXBnIF              __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 RXBnIF_bit          _BIT_ACCESS(PIR5,1)
// IPR5<RXBnIP>
extern volatile __bit                   RXBnIP              __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 RXBnIP_bit          _BIT_ACCESS(IPR5,1)
// BAUDCON1<RXDTP1>
extern volatile __bit                   RXDTP1              __at(0x7D3D);	// @ (0xFA7 * 8 + 5)
#define                                 RXDTP1_bit          _BIT_ACCESS(BAUDCON1,5)
// BAUDCON2<RXDTP2>
extern volatile __bit                   RXDTP2              __at(0x7DCD);	// @ (0xFB9 * 8 + 5)
#define                                 RXDTP2_bit          _BIT_ACCESS(BAUDCON2,5)
// RXF0EIDL<RXF0EID0>
extern volatile __bit                   RXF0EID0            __at(0x7718);	// @ (0xEE3 * 8 + 0)
#define                                 RXF0EID0_bit        _BIT_ACCESS(RXF0EIDL,0)
// RXF0EIDL<RXF0EID1>
extern volatile __bit                   RXF0EID1            __at(0x7719);	// @ (0xEE3 * 8 + 1)
#define                                 RXF0EID1_bit        _BIT_ACCESS(RXF0EIDL,1)
// RXF0EIDH<RXF0EID10>
extern volatile __bit                   RXF0EID10           __at(0x7712);	// @ (0xEE2 * 8 + 2)
#define                                 RXF0EID10_bit       _BIT_ACCESS(RXF0EIDH,2)
// RXF0EIDH<RXF0EID11>
extern volatile __bit                   RXF0EID11           __at(0x7713);	// @ (0xEE2 * 8 + 3)
#define                                 RXF0EID11_bit       _BIT_ACCESS(RXF0EIDH,3)
// RXF0EIDH<RXF0EID12>
extern volatile __bit                   RXF0EID12           __at(0x7714);	// @ (0xEE2 * 8 + 4)
#define                                 RXF0EID12_bit       _BIT_ACCESS(RXF0EIDH,4)
// RXF0EIDH<RXF0EID13>
extern volatile __bit                   RXF0EID13           __at(0x7715);	// @ (0xEE2 * 8 + 5)
#define                                 RXF0EID13_bit       _BIT_ACCESS(RXF0EIDH,5)
// RXF0EIDH<RXF0EID14>
extern volatile __bit                   RXF0EID14           __at(0x7716);	// @ (0xEE2 * 8 + 6)
#define                                 RXF0EID14_bit       _BIT_ACCESS(RXF0EIDH,6)
// RXF0EIDH<RXF0EID15>
extern volatile __bit                   RXF0EID15           __at(0x7717);	// @ (0xEE2 * 8 + 7)
#define                                 RXF0EID15_bit       _BIT_ACCESS(RXF0EIDH,7)
// RXF0SIDL<RXF0EID16>
extern volatile __bit                   RXF0EID16           __at(0x7708);	// @ (0xEE1 * 8 + 0)
#define                                 RXF0EID16_bit       _BIT_ACCESS(RXF0SIDL,0)
// RXF0SIDL<RXF0EID17>
extern volatile __bit                   RXF0EID17           __at(0x7709);	// @ (0xEE1 * 8 + 1)
#define                                 RXF0EID17_bit       _BIT_ACCESS(RXF0SIDL,1)
// RXF0EIDL<RXF0EID2>
extern volatile __bit                   RXF0EID2            __at(0x771A);	// @ (0xEE3 * 8 + 2)
#define                                 RXF0EID2_bit        _BIT_ACCESS(RXF0EIDL,2)
// RXF0EIDL<RXF0EID3>
extern volatile __bit                   RXF0EID3            __at(0x771B);	// @ (0xEE3 * 8 + 3)
#define                                 RXF0EID3_bit        _BIT_ACCESS(RXF0EIDL,3)
// RXF0EIDL<RXF0EID4>
extern volatile __bit                   RXF0EID4            __at(0x771C);	// @ (0xEE3 * 8 + 4)
#define                                 RXF0EID4_bit        _BIT_ACCESS(RXF0EIDL,4)
// RXF0EIDL<RXF0EID5>
extern volatile __bit                   RXF0EID5            __at(0x771D);	// @ (0xEE3 * 8 + 5)
#define                                 RXF0EID5_bit        _BIT_ACCESS(RXF0EIDL,5)
// RXF0EIDL<RXF0EID6>
extern volatile __bit                   RXF0EID6            __at(0x771E);	// @ (0xEE3 * 8 + 6)
#define                                 RXF0EID6_bit        _BIT_ACCESS(RXF0EIDL,6)
// RXF0EIDL<RXF0EID7>
extern volatile __bit                   RXF0EID7            __at(0x771F);	// @ (0xEE3 * 8 + 7)
#define                                 RXF0EID7_bit        _BIT_ACCESS(RXF0EIDL,7)
// RXF0EIDH<RXF0EID8>
extern volatile __bit                   RXF0EID8            __at(0x7710);	// @ (0xEE2 * 8 + 0)
#define                                 RXF0EID8_bit        _BIT_ACCESS(RXF0EIDH,0)
// RXF0EIDH<RXF0EID9>
extern volatile __bit                   RXF0EID9            __at(0x7711);	// @ (0xEE2 * 8 + 1)
#define                                 RXF0EID9_bit        _BIT_ACCESS(RXF0EIDH,1)
// RXFCON0<RXF0EN>
extern volatile __bit                   RXF0EN              __at(0x7230);	// @ (0xE46 * 8 + 0)
#define                                 RXF0EN_bit          _BIT_ACCESS(RXFCON0,0)
// RXF0SIDL<RXF0EXIDEN>
extern volatile __bit                   RXF0EXIDEN          __at(0x770B);	// @ (0xEE1 * 8 + 3)
#define                                 RXF0EXIDEN_bit      _BIT_ACCESS(RXF0SIDL,3)
// RXF0SIDL<RXF0SID0>
extern volatile __bit                   RXF0SID0            __at(0x770D);	// @ (0xEE1 * 8 + 5)
#define                                 RXF0SID0_bit        _BIT_ACCESS(RXF0SIDL,5)
// RXF0SIDL<RXF0SID1>
extern volatile __bit                   RXF0SID1            __at(0x770E);	// @ (0xEE1 * 8 + 6)
#define                                 RXF0SID1_bit        _BIT_ACCESS(RXF0SIDL,6)
// RXF0SIDH<RXF0SID10>
extern volatile __bit                   RXF0SID10           __at(0x7707);	// @ (0xEE0 * 8 + 7)
#define                                 RXF0SID10_bit       _BIT_ACCESS(RXF0SIDH,7)
// RXF0SIDL<RXF0SID2>
extern volatile __bit                   RXF0SID2            __at(0x770F);	// @ (0xEE1 * 8 + 7)
#define                                 RXF0SID2_bit        _BIT_ACCESS(RXF0SIDL,7)
// RXF0SIDH<RXF0SID3>
extern volatile __bit                   RXF0SID3            __at(0x7700);	// @ (0xEE0 * 8 + 0)
#define                                 RXF0SID3_bit        _BIT_ACCESS(RXF0SIDH,0)
// RXF0SIDH<RXF0SID4>
extern volatile __bit                   RXF0SID4            __at(0x7701);	// @ (0xEE0 * 8 + 1)
#define                                 RXF0SID4_bit        _BIT_ACCESS(RXF0SIDH,1)
// RXF0SIDH<RXF0SID5>
extern volatile __bit                   RXF0SID5            __at(0x7702);	// @ (0xEE0 * 8 + 2)
#define                                 RXF0SID5_bit        _BIT_ACCESS(RXF0SIDH,2)
// RXF0SIDH<RXF0SID6>
extern volatile __bit                   RXF0SID6            __at(0x7703);	// @ (0xEE0 * 8 + 3)
#define                                 RXF0SID6_bit        _BIT_ACCESS(RXF0SIDH,3)
// RXF0SIDH<RXF0SID7>
extern volatile __bit                   RXF0SID7            __at(0x7704);	// @ (0xEE0 * 8 + 4)
#define                                 RXF0SID7_bit        _BIT_ACCESS(RXF0SIDH,4)
// RXF0SIDH<RXF0SID8>
extern volatile __bit                   RXF0SID8            __at(0x7705);	// @ (0xEE0 * 8 + 5)
#define                                 RXF0SID8_bit        _BIT_ACCESS(RXF0SIDH,5)
// RXF0SIDH<RXF0SID9>
extern volatile __bit                   RXF0SID9            __at(0x7706);	// @ (0xEE0 * 8 + 6)
#define                                 RXF0SID9_bit        _BIT_ACCESS(RXF0SIDH,6)
// RXF10EIDL<RXF10EID0>
extern volatile __bit                   RXF10EID0           __at(0x72D8);	// @ (0xE5B * 8 + 0)
#define                                 RXF10EID0_bit       _BIT_ACCESS(RXF10EIDL,0)
// RXF10EIDL<RXF10EID1>
extern volatile __bit                   RXF10EID1           __at(0x72D9);	// @ (0xE5B * 8 + 1)
#define                                 RXF10EID1_bit       _BIT_ACCESS(RXF10EIDL,1)
// RXF10EIDH<RXF10EID10>
extern volatile __bit                   RXF10EID10          __at(0x72D2);	// @ (0xE5A * 8 + 2)
#define                                 RXF10EID10_bit      _BIT_ACCESS(RXF10EIDH,2)
// RXF10EIDH<RXF10EID11>
extern volatile __bit                   RXF10EID11          __at(0x72D3);	// @ (0xE5A * 8 + 3)
#define                                 RXF10EID11_bit      _BIT_ACCESS(RXF10EIDH,3)
// RXF10EIDH<RXF10EID12>
extern volatile __bit                   RXF10EID12          __at(0x72D4);	// @ (0xE5A * 8 + 4)
#define                                 RXF10EID12_bit      _BIT_ACCESS(RXF10EIDH,4)
// RXF10EIDH<RXF10EID13>
extern volatile __bit                   RXF10EID13          __at(0x72D5);	// @ (0xE5A * 8 + 5)
#define                                 RXF10EID13_bit      _BIT_ACCESS(RXF10EIDH,5)
// RXF10EIDH<RXF10EID14>
extern volatile __bit                   RXF10EID14          __at(0x72D6);	// @ (0xE5A * 8 + 6)
#define                                 RXF10EID14_bit      _BIT_ACCESS(RXF10EIDH,6)
// RXF10EIDH<RXF10EID15>
extern volatile __bit                   RXF10EID15          __at(0x72D7);	// @ (0xE5A * 8 + 7)
#define                                 RXF10EID15_bit      _BIT_ACCESS(RXF10EIDH,7)
// RXF10SIDL<RXF10EID16>
extern volatile __bit                   RXF10EID16          __at(0x72C8);	// @ (0xE59 * 8 + 0)
#define                                 RXF10EID16_bit      _BIT_ACCESS(RXF10SIDL,0)
// RXF10SIDL<RXF10EID17>
extern volatile __bit                   RXF10EID17          __at(0x72C9);	// @ (0xE59 * 8 + 1)
#define                                 RXF10EID17_bit      _BIT_ACCESS(RXF10SIDL,1)
// RXF10EIDL<RXF10EID2>
extern volatile __bit                   RXF10EID2           __at(0x72DA);	// @ (0xE5B * 8 + 2)
#define                                 RXF10EID2_bit       _BIT_ACCESS(RXF10EIDL,2)
// RXF10EIDL<RXF10EID3>
extern volatile __bit                   RXF10EID3           __at(0x72DB);	// @ (0xE5B * 8 + 3)
#define                                 RXF10EID3_bit       _BIT_ACCESS(RXF10EIDL,3)
// RXF10EIDL<RXF10EID4>
extern volatile __bit                   RXF10EID4           __at(0x72DC);	// @ (0xE5B * 8 + 4)
#define                                 RXF10EID4_bit       _BIT_ACCESS(RXF10EIDL,4)
// RXF10EIDL<RXF10EID5>
extern volatile __bit                   RXF10EID5           __at(0x72DD);	// @ (0xE5B * 8 + 5)
