MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K80/mcu.h
extern volatile __bit                   RXF14EID15          __at(0x7357);	// @ (0xE6A * 8 + 7)
#define                                 RXF14EID15_bit      _BIT_ACCESS(RXF14EIDH,7)
// RXF14SIDL<RXF14EID16>
extern volatile __bit                   RXF14EID16          __at(0x7348);	// @ (0xE69 * 8 + 0)
#define                                 RXF14EID16_bit      _BIT_ACCESS(RXF14SIDL,0)
// RXF14SIDL<RXF14EID17>
extern volatile __bit                   RXF14EID17          __at(0x7349);	// @ (0xE69 * 8 + 1)
#define                                 RXF14EID17_bit      _BIT_ACCESS(RXF14SIDL,1)
// RXF14EIDL<RXF14EID2>
extern volatile __bit                   RXF14EID2           __at(0x735A);	// @ (0xE6B * 8 + 2)
#define                                 RXF14EID2_bit       _BIT_ACCESS(RXF14EIDL,2)
// RXF14EIDL<RXF14EID3>
extern volatile __bit                   RXF14EID3           __at(0x735B);	// @ (0xE6B * 8 + 3)
#define                                 RXF14EID3_bit       _BIT_ACCESS(RXF14EIDL,3)
// RXF14EIDL<RXF14EID4>
extern volatile __bit                   RXF14EID4           __at(0x735C);	// @ (0xE6B * 8 + 4)
#define                                 RXF14EID4_bit       _BIT_ACCESS(RXF14EIDL,4)
// RXF14EIDL<RXF14EID5>
extern volatile __bit                   RXF14EID5           __at(0x735D);	// @ (0xE6B * 8 + 5)
#define                                 RXF14EID5_bit       _BIT_ACCESS(RXF14EIDL,5)
// RXF14EIDL<RXF14EID6>
extern volatile __bit                   RXF14EID6           __at(0x735E);	// @ (0xE6B * 8 + 6)
#define                                 RXF14EID6_bit       _BIT_ACCESS(RXF14EIDL,6)
// RXF14EIDL<RXF14EID7>
extern volatile __bit                   RXF14EID7           __at(0x735F);	// @ (0xE6B * 8 + 7)
#define                                 RXF14EID7_bit       _BIT_ACCESS(RXF14EIDL,7)
// RXF14EIDH<RXF14EID8>
extern volatile __bit                   RXF14EID8           __at(0x7350);	// @ (0xE6A * 8 + 0)
#define                                 RXF14EID8_bit       _BIT_ACCESS(RXF14EIDH,0)
// RXF14EIDH<RXF14EID9>
extern volatile __bit                   RXF14EID9           __at(0x7351);	// @ (0xE6A * 8 + 1)
#define                                 RXF14EID9_bit       _BIT_ACCESS(RXF14EIDH,1)
// RXFCON1<RXF14EN>
extern volatile __bit                   RXF14EN             __at(0x723E);	// @ (0xE47 * 8 + 6)
#define                                 RXF14EN_bit         _BIT_ACCESS(RXFCON1,6)
// RXF14SIDL<RXF14EXIDEN>
extern volatile __bit                   RXF14EXIDEN         __at(0x734B);	// @ (0xE69 * 8 + 3)
#define                                 RXF14EXIDEN_bit     _BIT_ACCESS(RXF14SIDL,3)
// RXF14SIDL<RXF14SID0>
extern volatile __bit                   RXF14SID0           __at(0x734D);	// @ (0xE69 * 8 + 5)
#define                                 RXF14SID0_bit       _BIT_ACCESS(RXF14SIDL,5)
// RXF14SIDL<RXF14SID1>
extern volatile __bit                   RXF14SID1           __at(0x734E);	// @ (0xE69 * 8 + 6)
#define                                 RXF14SID1_bit       _BIT_ACCESS(RXF14SIDL,6)
// RXF14SIDH<RXF14SID10>
extern volatile __bit                   RXF14SID10          __at(0x7347);	// @ (0xE68 * 8 + 7)
#define                                 RXF14SID10_bit      _BIT_ACCESS(RXF14SIDH,7)
// RXF14SIDL<RXF14SID2>
extern volatile __bit                   RXF14SID2           __at(0x734F);	// @ (0xE69 * 8 + 7)
#define                                 RXF14SID2_bit       _BIT_ACCESS(RXF14SIDL,7)
// RXF14SIDH<RXF14SID3>
extern volatile __bit                   RXF14SID3           __at(0x7340);	// @ (0xE68 * 8 + 0)
#define                                 RXF14SID3_bit       _BIT_ACCESS(RXF14SIDH,0)
// RXF14SIDH<RXF14SID4>
extern volatile __bit                   RXF14SID4           __at(0x7341);	// @ (0xE68 * 8 + 1)
#define                                 RXF14SID4_bit       _BIT_ACCESS(RXF14SIDH,1)
// RXF14SIDH<RXF14SID5>
extern volatile __bit                   RXF14SID5           __at(0x7342);	// @ (0xE68 * 8 + 2)
#define                                 RXF14SID5_bit       _BIT_ACCESS(RXF14SIDH,2)
// RXF14SIDH<RXF14SID6>
extern volatile __bit                   RXF14SID6           __at(0x7343);	// @ (0xE68 * 8 + 3)
#define                                 RXF14SID6_bit       _BIT_ACCESS(RXF14SIDH,3)
// RXF14SIDH<RXF14SID7>
extern volatile __bit                   RXF14SID7           __at(0x7344);	// @ (0xE68 * 8 + 4)
#define                                 RXF14SID7_bit       _BIT_ACCESS(RXF14SIDH,4)
// RXF14SIDH<RXF14SID8>
extern volatile __bit                   RXF14SID8           __at(0x7345);	// @ (0xE68 * 8 + 5)
#define                                 RXF14SID8_bit       _BIT_ACCESS(RXF14SIDH,5)
// RXF14SIDH<RXF14SID9>
extern volatile __bit                   RXF14SID9           __at(0x7346);	// @ (0xE68 * 8 + 6)
#define                                 RXF14SID9_bit       _BIT_ACCESS(RXF14SIDH,6)
// RXF15EIDL<RXF15EID0>
extern volatile __bit                   RXF15EID0           __at(0x7378);	// @ (0xE6F * 8 + 0)
#define                                 RXF15EID0_bit       _BIT_ACCESS(RXF15EIDL,0)
// RXF15EIDL<RXF15EID1>
extern volatile __bit                   RXF15EID1           __at(0x7379);	// @ (0xE6F * 8 + 1)
#define                                 RXF15EID1_bit       _BIT_ACCESS(RXF15EIDL,1)
// RXF15EIDH<RXF15EID10>
extern volatile __bit                   RXF15EID10          __at(0x7372);	// @ (0xE6E * 8 + 2)
#define                                 RXF15EID10_bit      _BIT_ACCESS(RXF15EIDH,2)
// RXF15EIDH<RXF15EID11>
extern volatile __bit                   RXF15EID11          __at(0x7373);	// @ (0xE6E * 8 + 3)
#define                                 RXF15EID11_bit      _BIT_ACCESS(RXF15EIDH,3)
// RXF15EIDH<RXF15EID12>
extern volatile __bit                   RXF15EID12          __at(0x7374);	// @ (0xE6E * 8 + 4)
#define                                 RXF15EID12_bit      _BIT_ACCESS(RXF15EIDH,4)
// RXF15EIDH<RXF15EID13>
extern volatile __bit                   RXF15EID13          __at(0x7375);	// @ (0xE6E * 8 + 5)
#define                                 RXF15EID13_bit      _BIT_ACCESS(RXF15EIDH,5)
// RXF15EIDH<RXF15EID14>
extern volatile __bit                   RXF15EID14          __at(0x7376);	// @ (0xE6E * 8 + 6)
#define                                 RXF15EID14_bit      _BIT_ACCESS(RXF15EIDH,6)
// RXF15EIDH<RXF15EID15>
extern volatile __bit                   RXF15EID15          __at(0x7377);	// @ (0xE6E * 8 + 7)
#define                                 RXF15EID15_bit      _BIT_ACCESS(RXF15EIDH,7)
// RXF15SIDL<RXF15EID16>
extern volatile __bit                   RXF15EID16          __at(0x7368);	// @ (0xE6D * 8 + 0)
#define                                 RXF15EID16_bit      _BIT_ACCESS(RXF15SIDL,0)
// RXF15SIDL<RXF15EID17>
extern volatile __bit                   RXF15EID17          __at(0x7369);	// @ (0xE6D * 8 + 1)
#define                                 RXF15EID17_bit      _BIT_ACCESS(RXF15SIDL,1)
// RXF15EIDL<RXF15EID2>
extern volatile __bit                   RXF15EID2           __at(0x737A);	// @ (0xE6F * 8 + 2)
#define                                 RXF15EID2_bit       _BIT_ACCESS(RXF15EIDL,2)
// RXF15EIDL<RXF15EID3>
extern volatile __bit                   RXF15EID3           __at(0x737B);	// @ (0xE6F * 8 + 3)
#define                                 RXF15EID3_bit       _BIT_ACCESS(RXF15EIDL,3)
// RXF15EIDL<RXF15EID4>
extern volatile __bit                   RXF15EID4           __at(0x737C);	// @ (0xE6F * 8 + 4)
#define                                 RXF15EID4_bit       _BIT_ACCESS(RXF15EIDL,4)
// RXF15EIDL<RXF15EID5>
extern volatile __bit                   RXF15EID5           __at(0x737D);	// @ (0xE6F * 8 + 5)
#define                                 RXF15EID5_bit       _BIT_ACCESS(RXF15EIDL,5)
// RXF15EIDL<RXF15EID6>
extern volatile __bit                   RXF15EID6           __at(0x737E);	// @ (0xE6F * 8 + 6)
#define                                 RXF15EID6_bit       _BIT_ACCESS(RXF15EIDL,6)
// RXF15EIDL<RXF15EID7>
extern volatile __bit                   RXF15EID7           __at(0x737F);	// @ (0xE6F * 8 + 7)
#define                                 RXF15EID7_bit       _BIT_ACCESS(RXF15EIDL,7)
// RXF15EIDH<RXF15EID8>
extern volatile __bit                   RXF15EID8           __at(0x7370);	// @ (0xE6E * 8 + 0)
#define                                 RXF15EID8_bit       _BIT_ACCESS(RXF15EIDH,0)
// RXF15EIDH<RXF15EID9>
extern volatile __bit                   RXF15EID9           __at(0x7371);	// @ (0xE6E * 8 + 1)
#define                                 RXF15EID9_bit       _BIT_ACCESS(RXF15EIDH,1)
// RXFCON1<RXF15EN>
extern volatile __bit                   RXF15EN             __at(0x723F);	// @ (0xE47 * 8 + 7)
#define                                 RXF15EN_bit         _BIT_ACCESS(RXFCON1,7)
// RXF15SIDL<RXF15EXIDEN>
extern volatile __bit                   RXF15EXIDEN         __at(0x736B);	// @ (0xE6D * 8 + 3)
#define                                 RXF15EXIDEN_bit     _BIT_ACCESS(RXF15SIDL,3)
// RXF15SIDL<RXF15SID0>
extern volatile __bit                   RXF15SID0           __at(0x736D);	// @ (0xE6D * 8 + 5)
#define                                 RXF15SID0_bit       _BIT_ACCESS(RXF15SIDL,5)
// RXF15SIDL<RXF15SID1>
extern volatile __bit                   RXF15SID1           __at(0x736E);	// @ (0xE6D * 8 + 6)
#define                                 RXF15SID1_bit       _BIT_ACCESS(RXF15SIDL,6)
// RXF15SIDH<RXF15SID10>
extern volatile __bit                   RXF15SID10          __at(0x7367);	// @ (0xE6C * 8 + 7)
#define                                 RXF15SID10_bit      _BIT_ACCESS(RXF15SIDH,7)
// RXF15SIDL<RXF15SID2>
extern volatile __bit                   RXF15SID2           __at(0x736F);	// @ (0xE6D * 8 + 7)
#define                                 RXF15SID2_bit       _BIT_ACCESS(RXF15SIDL,7)
// RXF15SIDH<RXF15SID3>
extern volatile __bit                   RXF15SID3           __at(0x7360);	// @ (0xE6C * 8 + 0)
#define                                 RXF15SID3_bit       _BIT_ACCESS(RXF15SIDH,0)
// RXF15SIDH<RXF15SID4>
extern volatile __bit                   RXF15SID4           __at(0x7361);	// @ (0xE6C * 8 + 1)
#define                                 RXF15SID4_bit       _BIT_ACCESS(RXF15SIDH,1)
// RXF15SIDH<RXF15SID5>
extern volatile __bit                   RXF15SID5           __at(0x7362);	// @ (0xE6C * 8 + 2)
#define                                 RXF15SID5_bit       _BIT_ACCESS(RXF15SIDH,2)
// RXF15SIDH<RXF15SID6>
extern volatile __bit                   RXF15SID6           __at(0x7363);	// @ (0xE6C * 8 + 3)
#define                                 RXF15SID6_bit       _BIT_ACCESS(RXF15SIDH,3)
// RXF15SIDH<RXF15SID7>
extern volatile __bit                   RXF15SID7           __at(0x7364);	// @ (0xE6C * 8 + 4)
#define                                 RXF15SID7_bit       _BIT_ACCESS(RXF15SIDH,4)
// RXF15SIDH<RXF15SID8>
extern volatile __bit                   RXF15SID8           __at(0x7365);	// @ (0xE6C * 8 + 5)
#define                                 RXF15SID8_bit       _BIT_ACCESS(RXF15SIDH,5)
// RXF15SIDH<RXF15SID9>
extern volatile __bit                   RXF15SID9           __at(0x7366);	// @ (0xE6C * 8 + 6)
#define                                 RXF15SID9_bit       _BIT_ACCESS(RXF15SIDH,6)
// RXF1EIDL<RXF1EID0>
extern volatile __bit                   RXF1EID0            __at(0x7738);	// @ (0xEE7 * 8 + 0)
#define                                 RXF1EID0_bit        _BIT_ACCESS(RXF1EIDL,0)
// RXF1EIDL<RXF1EID1>
extern volatile __bit                   RXF1EID1            __at(0x7739);	// @ (0xEE7 * 8 + 1)
#define                                 RXF1EID1_bit        _BIT_ACCESS(RXF1EIDL,1)
// RXF1EIDH<RXF1EID10>
extern volatile __bit                   RXF1EID10           __at(0x7732);	// @ (0xEE6 * 8 + 2)
#define                                 RXF1EID10_bit       _BIT_ACCESS(RXF1EIDH,2)
// RXF1EIDH<RXF1EID11>
extern volatile __bit                   RXF1EID11           __at(0x7733);	// @ (0xEE6 * 8 + 3)
#define                                 RXF1EID11_bit       _BIT_ACCESS(RXF1EIDH,3)
// RXF1EIDH<RXF1EID12>
extern volatile __bit                   RXF1EID12           __at(0x7734);	// @ (0xEE6 * 8 + 4)
#define                                 RXF1EID12_bit       _BIT_ACCESS(RXF1EIDH,4)
// RXF1EIDH<RXF1EID13>
extern volatile __bit                   RXF1EID13           __at(0x7735);	// @ (0xEE6 * 8 + 5)
#define                                 RXF1EID13_bit       _BIT_ACCESS(RXF1EIDH,5)
// RXF1EIDH<RXF1EID14>
extern volatile __bit                   RXF1EID14           __at(0x7736);	// @ (0xEE6 * 8 + 6)
#define                                 RXF1EID14_bit       _BIT_ACCESS(RXF1EIDH,6)
// RXF1EIDH<RXF1EID15>
extern volatile __bit                   RXF1EID15           __at(0x7737);	// @ (0xEE6 * 8 + 7)
#define                                 RXF1EID15_bit       _BIT_ACCESS(RXF1EIDH,7)
// RXF1SIDL<RXF1EID16>
extern volatile __bit                   RXF1EID16           __at(0x7728);	// @ (0xEE5 * 8 + 0)
#define                                 RXF1EID16_bit       _BIT_ACCESS(RXF1SIDL,0)
// RXF1SIDL<RXF1EID17>
extern volatile __bit                   RXF1EID17           __at(0x7729);	// @ (0xEE5 * 8 + 1)
#define                                 RXF1EID17_bit       _BIT_ACCESS(RXF1SIDL,1)
// RXF1EIDL<RXF1EID2>
extern volatile __bit                   RXF1EID2            __at(0x773A);	// @ (0xEE7 * 8 + 2)
#define                                 RXF1EID2_bit        _BIT_ACCESS(RXF1EIDL,2)
// RXF1EIDL<RXF1EID3>
extern volatile __bit                   RXF1EID3            __at(0x773B);	// @ (0xEE7 * 8 + 3)
#define                                 RXF1EID3_bit        _BIT_ACCESS(RXF1EIDL,3)
// RXF1EIDL<RXF1EID4>
extern volatile __bit                   RXF1EID4            __at(0x773C);	// @ (0xEE7 * 8 + 4)
#define                                 RXF1EID4_bit        _BIT_ACCESS(RXF1EIDL,4)
// RXF1EIDL<RXF1EID5>
extern volatile __bit                   RXF1EID5            __at(0x773D);	// @ (0xEE7 * 8 + 5)
#define                                 RXF1EID5_bit        _BIT_ACCESS(RXF1EIDL,5)
// RXF1EIDL<RXF1EID6>
extern volatile __bit                   RXF1EID6            __at(0x773E);	// @ (0xEE7 * 8 + 6)
#define                                 RXF1EID6_bit        _BIT_ACCESS(RXF1EIDL,6)
// RXF1EIDL<RXF1EID7>
extern volatile __bit                   RXF1EID7            __at(0x773F);	// @ (0xEE7 * 8 + 7)
#define                                 RXF1EID7_bit        _BIT_ACCESS(RXF1EIDL,7)
// RXF1EIDH<RXF1EID8>
extern volatile __bit                   RXF1EID8            __at(0x7730);	// @ (0xEE6 * 8 + 0)
#define                                 RXF1EID8_bit        _BIT_ACCESS(RXF1EIDH,0)
// RXF1EIDH<RXF1EID9>
extern volatile __bit                   RXF1EID9            __at(0x7731);	// @ (0xEE6 * 8 + 1)
#define                                 RXF1EID9_bit        _BIT_ACCESS(RXF1EIDH,1)
// RXFCON0<RXF1EN>
extern volatile __bit                   RXF1EN              __at(0x7231);	// @ (0xE46 * 8 + 1)
#define                                 RXF1EN_bit          _BIT_ACCESS(RXFCON0,1)
// RXF1SIDL<RXF1EXIDEN>
extern volatile __bit                   RXF1EXIDEN          __at(0x772B);	// @ (0xEE5 * 8 + 3)
#define                                 RXF1EXIDEN_bit      _BIT_ACCESS(RXF1SIDL,3)
// RXF1SIDL<RXF1SID0>
extern volatile __bit                   RXF1SID0            __at(0x772D);	// @ (0xEE5 * 8 + 5)
#define                                 RXF1SID0_bit        _BIT_ACCESS(RXF1SIDL,5)
// RXF1SIDL<RXF1SID1>
extern volatile __bit                   RXF1SID1            __at(0x772E);	// @ (0xEE5 * 8 + 6)
#define                                 RXF1SID1_bit        _BIT_ACCESS(RXF1SIDL,6)
// RXF1SIDH<RXF1SID10>
extern volatile __bit                   RXF1SID10           __at(0x7727);	// @ (0xEE4 * 8 + 7)
#define                                 RXF1SID10_bit       _BIT_ACCESS(RXF1SIDH,7)
// RXF1SIDL<RXF1SID2>
extern volatile __bit                   RXF1SID2            __at(0x772F);	// @ (0xEE5 * 8 + 7)
#define                                 RXF1SID2_bit        _BIT_ACCESS(RXF1SIDL,7)
// RXF1SIDH<RXF1SID3>
extern volatile __bit                   RXF1SID3            __at(0x7720);	// @ (0xEE4 * 8 + 0)
#define                                 RXF1SID3_bit        _BIT_ACCESS(RXF1SIDH,0)
// RXF1SIDH<RXF1SID4>
extern volatile __bit                   RXF1SID4            __at(0x7721);	// @ (0xEE4 * 8 + 1)
#define                                 RXF1SID4_bit        _BIT_ACCESS(RXF1SIDH,1)
// RXF1SIDH<RXF1SID5>
extern volatile __bit                   RXF1SID5            __at(0x7722);	// @ (0xEE4 * 8 + 2)
#define                                 RXF1SID5_bit        _BIT_ACCESS(RXF1SIDH,2)
// RXF1SIDH<RXF1SID6>
extern volatile __bit                   RXF1SID6            __at(0x7723);	// @ (0xEE4 * 8 + 3)
#define                                 RXF1SID6_bit        _BIT_ACCESS(RXF1SIDH,3)
// RXF1SIDH<RXF1SID7>
extern volatile __bit                   RXF1SID7            __at(0x7724);	// @ (0xEE4 * 8 + 4)
#define                                 RXF1SID7_bit        _BIT_ACCESS(RXF1SIDH,4)
// RXF1SIDH<RXF1SID8>
extern volatile __bit                   RXF1SID8            __at(0x7725);	// @ (0xEE4 * 8 + 5)
#define                                 RXF1SID8_bit        _BIT_ACCESS(RXF1SIDH,5)
// RXF1SIDH<RXF1SID9>
extern volatile __bit                   RXF1SID9            __at(0x7726);	// @ (0xEE4 * 8 + 6)
#define                                 RXF1SID9_bit        _BIT_ACCESS(RXF1SIDH,6)
// RXF2EIDL<RXF2EID0>
extern volatile __bit                   RXF2EID0            __at(0x7758);	// @ (0xEEB * 8 + 0)
#define                                 RXF2EID0_bit        _BIT_ACCESS(RXF2EIDL,0)
// RXF2EIDL<RXF2EID1>
extern volatile __bit                   RXF2EID1            __at(0x7759);	// @ (0xEEB * 8 + 1)
#define                                 RXF2EID1_bit        _BIT_ACCESS(RXF2EIDL,1)
// RXF2EIDH<RXF2EID10>
extern volatile __bit                   RXF2EID10           __at(0x7752);	// @ (0xEEA * 8 + 2)
#define                                 RXF2EID10_bit       _BIT_ACCESS(RXF2EIDH,2)
// RXF2EIDH<RXF2EID11>
extern volatile __bit                   RXF2EID11           __at(0x7753);	// @ (0xEEA * 8 + 3)
#define                                 RXF2EID11_bit       _BIT_ACCESS(RXF2EIDH,3)
// RXF2EIDH<RXF2EID12>
extern volatile __bit                   RXF2EID12           __at(0x7754);	// @ (0xEEA * 8 + 4)
#define                                 RXF2EID12_bit       _BIT_ACCESS(RXF2EIDH,4)
// RXF2EIDH<RXF2EID13>
extern volatile __bit                   RXF2EID13           __at(0x7755);	// @ (0xEEA * 8 + 5)
#define                                 RXF2EID13_bit       _BIT_ACCESS(RXF2EIDH,5)
// RXF2EIDH<RXF2EID14>
extern volatile __bit                   RXF2EID14           __at(0x7756);	// @ (0xEEA * 8 + 6)
#define                                 RXF2EID14_bit       _BIT_ACCESS(RXF2EIDH,6)
// RXF2EIDH<RXF2EID15>
extern volatile __bit                   RXF2EID15           __at(0x7757);	// @ (0xEEA * 8 + 7)
#define                                 RXF2EID15_bit       _BIT_ACCESS(RXF2EIDH,7)
// RXF2SIDL<RXF2EID16>
extern volatile __bit                   RXF2EID16           __at(0x7748);	// @ (0xEE9 * 8 + 0)
#define                                 RXF2EID16_bit       _BIT_ACCESS(RXF2SIDL,0)
// RXF2SIDL<RXF2EID17>
extern volatile __bit                   RXF2EID17           __at(0x7749);	// @ (0xEE9 * 8 + 1)
#define                                 RXF2EID17_bit       _BIT_ACCESS(RXF2SIDL,1)
// RXF2EIDL<RXF2EID2>
extern volatile __bit                   RXF2EID2            __at(0x775A);	// @ (0xEEB * 8 + 2)
#define                                 RXF2EID2_bit        _BIT_ACCESS(RXF2EIDL,2)
// RXF2EIDL<RXF2EID3>
extern volatile __bit                   RXF2EID3            __at(0x775B);	// @ (0xEEB * 8 + 3)
#define                                 RXF2EID3_bit        _BIT_ACCESS(RXF2EIDL,3)
// RXF2EIDL<RXF2EID4>
extern volatile __bit                   RXF2EID4            __at(0x775C);	// @ (0xEEB * 8 + 4)
#define                                 RXF2EID4_bit        _BIT_ACCESS(RXF2EIDL,4)
// RXF2EIDL<RXF2EID5>
extern volatile __bit                   RXF2EID5            __at(0x775D);	// @ (0xEEB * 8 + 5)
#define                                 RXF2EID5_bit        _BIT_ACCESS(RXF2EIDL,5)
// RXF2EIDL<RXF2EID6>
extern volatile __bit                   RXF2EID6            __at(0x775E);	// @ (0xEEB * 8 + 6)
#define                                 RXF2EID6_bit        _BIT_ACCESS(RXF2EIDL,6)
// RXF2EIDL<RXF2EID7>
extern volatile __bit                   RXF2EID7            __at(0x775F);	// @ (0xEEB * 8 + 7)
#define                                 RXF2EID7_bit        _BIT_ACCESS(RXF2EIDL,7)
// RXF2EIDH<RXF2EID8>
extern volatile __bit                   RXF2EID8            __at(0x7750);	// @ (0xEEA * 8 + 0)
#define                                 RXF2EID8_bit        _BIT_ACCESS(RXF2EIDH,0)
// RXF2EIDH<RXF2EID9>
extern volatile __bit                   RXF2EID9            __at(0x7751);	// @ (0xEEA * 8 + 1)
#define                                 RXF2EID9_bit        _BIT_ACCESS(RXF2EIDH,1)
// RXFCON0<RXF2EN>
extern volatile __bit                   RXF2EN              __at(0x7232);	// @ (0xE46 * 8 + 2)
#define                                 RXF2EN_bit          _BIT_ACCESS(RXFCON0,2)
// RXF2SIDL<RXF2EXIDEN>
extern volatile __bit                   RXF2EXIDEN          __at(0x774B);	// @ (0xEE9 * 8 + 3)
#define                                 RXF2EXIDEN_bit      _BIT_ACCESS(RXF2SIDL,3)
// RXF2SIDL<RXF2SID0>
extern volatile __bit                   RXF2SID0            __at(0x774D);	// @ (0xEE9 * 8 + 5)
#define                                 RXF2SID0_bit        _BIT_ACCESS(RXF2SIDL,5)
// RXF2SIDL<RXF2SID1>
extern volatile __bit                   RXF2SID1            __at(0x774E);	// @ (0xEE9 * 8 + 6)
#define                                 RXF2SID1_bit        _BIT_ACCESS(RXF2SIDL,6)
// RXF2SIDH<RXF2SID10>
extern volatile __bit                   RXF2SID10           __at(0x7747);	// @ (0xEE8 * 8 + 7)
#define                                 RXF2SID10_bit       _BIT_ACCESS(RXF2SIDH,7)
// RXF2SIDL<RXF2SID2>
extern volatile __bit                   RXF2SID2            __at(0x774F);	// @ (0xEE9 * 8 + 7)
#define                                 RXF2SID2_bit        _BIT_ACCESS(RXF2SIDL,7)
// RXF2SIDH<RXF2SID3>
extern volatile __bit                   RXF2SID3            __at(0x7740);	// @ (0xEE8 * 8 + 0)
#define                                 RXF2SID3_bit        _BIT_ACCESS(RXF2SIDH,0)
// RXF2SIDH<RXF2SID4>
extern volatile __bit                   RXF2SID4            __at(0x7741);	// @ (0xEE8 * 8 + 1)
#define                                 RXF2SID4_bit        _BIT_ACCESS(RXF2SIDH,1)
// RXF2SIDH<RXF2SID5>
extern volatile __bit                   RXF2SID5            __at(0x7742);	// @ (0xEE8 * 8 + 2)
#define                                 RXF2SID5_bit        _BIT_ACCESS(RXF2SIDH,2)
// RXF2SIDH<RXF2SID6>
extern volatile __bit                   RXF2SID6            __at(0x7743);	// @ (0xEE8 * 8 + 3)
#define                                 RXF2SID6_bit        _BIT_ACCESS(RXF2SIDH,3)
// RXF2SIDH<RXF2SID7>
extern volatile __bit                   RXF2SID7            __at(0x7744);	// @ (0xEE8 * 8 + 4)
#define                                 RXF2SID7_bit        _BIT_ACCESS(RXF2SIDH,4)
// RXF2SIDH<RXF2SID8>
extern volatile __bit                   RXF2SID8            __at(0x7745);	// @ (0xEE8 * 8 + 5)
#define                                 RXF2SID8_bit        _BIT_ACCESS(RXF2SIDH,5)
// RXF2SIDH<RXF2SID9>
extern volatile __bit                   RXF2SID9            __at(0x7746);	// @ (0xEE8 * 8 + 6)
#define                                 RXF2SID9_bit        _BIT_ACCESS(RXF2SIDH,6)
// RXF3EIDL<RXF3EID0>
extern volatile __bit                   RXF3EID0            __at(0x7778);	// @ (0xEEF * 8 + 0)
#define                                 RXF3EID0_bit        _BIT_ACCESS(RXF3EIDL,0)
// RXF3EIDL<RXF3EID1>
extern volatile __bit                   RXF3EID1            __at(0x7779);	// @ (0xEEF * 8 + 1)
